------------------------------------------------------------
print( "‡ Јаг§Є  ‘harbornscript.lua" )
------------------------------------------------------------


function PCBorn ()


	InitTrigger()
	TriggerCondition( 1, IsSpawnPos, "\192\240\227\229\237\242" )
	--TriggerCondition( 1, IsSpawnPos, "Аргент" )
	TriggerAction( 1, ObligeAcceptMission, 1 )
	TriggerCondition( 2, IsSpawnPos, "\216\224\233\242\224\237" )
	--TriggerCondition( 2, IsSpawnPos, "Шайтан" )
	TriggerAction( 2, ObligeAcceptMission, 2 )
	TriggerCondition( 3, IsSpawnPos, "\203\229\228\251\237\252" )
	--TriggerCondition( 3, IsSpawnPos, "Ледынь" )
	TriggerAction( 3, ObligeAcceptMission, 3 )
	local triggerlist = GetMultiTrigger()
	
	InitTrigger()
	TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"\199\228\240\224\226\241\242\226\243\233 \228\240\243\227 :)  \196\238\225\240\238 \239\238\230\224\235\238\226\224\242\252 \237\224 \241\229\240\226\229\240 Little WarriorS. \205\224\228\229\229\236\241\255, \247\242\238 \242\229\225\229 \243 \237\224\241 \239\238\237\240\224\226\232\242\241\255! \192\228\236\232\237\232\241\242\240\224\242\238\240\238\236 \255\226\235\255\229\242\241\255 BopoHangel.\209\238\226\229\242\243\229\236 \241\237\224\247\224\235\224 \239\240\238\247\232\242\224\242\252 \239\240\224\226\232\235\224 \232 \239\238\241\238\225\232\255 \239\238 \241\229\240\226\229\240\243 \237\224 \237\224\248\229 \244\238\240\243\236\229 \239\238 \224\228\240\229\241\243 www.little-warrior.ru " )	
	--TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"Здравствуй друг :)  Добро пожаловать на сервер Little WarriorS. Надеемся, что тебе у нас понравится! Администратором является BopoHangel.Советуем сначала прочитать правила и пособия по серверу на наше форуме по адресу www.little-warrior.ru " )
	TriggerAction( 1, AddTrigger, 60000, TE_LEVELUP, 2, 1 )
	TriggerAction( 1, AddTrigger, 60001, TE_LEVELUP, 5, 1 )
	TriggerAction( 1, AddTrigger, 60002, TE_LEVELUP, 9, 1 )
	TriggerAction( 1, AddTrigger, 60003, TE_LEVELUP, 10, 1 )
	TriggerAction( 1, AddTrigger, 60004, TE_LEVELUP, 45, 1 )
	TriggerAction( 1, MultiTrigger, triggerlist, 3 )
	TriggerAction( 1, SaveMissionData )


	RegTrigger( 88888, 1 )
	
	InitTrigger()
	TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    \207\238\231\228\240\224\226\235\255\229\236! \209\229\233\247\224\241 \255 \238\225\250\255\241\237\254 \194\224\236 \234\224\234 \232\241\239\238\235\252\231\238\226\224\242\252 \240\224\228\224\240. \209\237\224\247\224\235\224 \237\224\230\236\232\242\229 \234\238\236\225\232\237\224\246\232\254 \234\235\224\226\232\248 Alt+R. \206\242\234\240\238\229\242\241\255 \241\224\236 \240\224\228\224\240. \194\251\225\229\240\232\242\229 \240\229\227\232\238\237, \234\238\242\238\240\251\233 \237\243\229\237 \226\224\236, \224 \231\224\242\229\236 \239\238\236\229\241\242\232\242\229 \242\243\228\224 \234\238\238\240\228\232\237\224\242\251. \207\238\255\226\232\242\241\255 \241\242\240\229\235\234\224, \226\229\228\243\249\224\255 \226 \242\238\247\234\243 \243\234\224\231\224\237\237\251\245 \234\238\238\240\228\232\237\224\242." )
	--TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    Поздравляем! Сейчас я объясню Вам как использовать радар. Сначала нажмите комбинацию клавиш Alt+R. Откроется сам радар. Выберите регион, который нуен вам, а затем поместите туда координаты. Появится стрелка, ведущая в точку указанных координат." )
	RegTrigger( 60000, 1 )
	
	InitTrigger()
	TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    \209\229\240\252\229\231\237\224\255 \225\232\242\226\224 \229\249\229 \226\239\229\240\229\228\232! \205\224\230\236\232\242\229 \234\237\238\239\234\243 \"Insert\" \247\242\238\225\251 \241\229\241\242\252, \242\224\234\232\236 \238\225\240\224\231\238\236 \226\224\248\224 \236\224\237\224 \232 \231\228\238\240\238\226\252\229 \225\243\228\229\242 \226\238\241\242\238\237\224\226\235\232\226\224\242\241\255 \237\224\236\237\238\227\238 \225\251\241\242\240\229\229. \205\224\230\236\232\242\229 \"Alt + \203\229\226\251\233 \234\237\238\239\234\224 \236\251\248\232\" \239\238 \232\227\240\238\234\243, \247\242\238\225\251 \241\235\229\228\238\226\224\242\252 \231\224 \237\232\236." )
	--TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    Серьезная битва еще впереди! Нажмите кнопку \"Insert\" чтобы сесть, таким образом ваша мана и здоровье будет востонавливатся намного быстрее. Нажмите \"Alt + Левый кнопка мыши\" по игроку, чтобы следовать за ним." )
	RegTrigger( 60001, 1 )
	
	InitTrigger()
	TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    \223 \226\229\240\254, \247\242\238 \226\251 \239\238\237\232\236\224\229\242\229 \238\241\237\238\226\237\243\254 \241\232\241\242\229\236\243 \225\238\255. \210\229\239\229\240\252 \237\224\241\242\224\235\238 \226\240\229\236\255, \247\242\238\225\251 \226\251\225\240\224\242\252 \234\235\224\241\241. \208\243\234\238\226\238\228\241\242\226\238 \205\238\226\232\247\234\224 \225\243\228\229\242 \240\229\234\238\236\229\237\228\238\226\224\242\252 \226\224\236 \241\238\238\242\226\229\242\241\242\226\243\254\249\232\245 \242\240\229\237\229\240\238\226. \200\228\232\242\229 \234 \205\224\241\242\224\226\237\232\246\229 \241\229\233\247\224\241 \232 \226\251\225\229\240\232\242\229 \234\235\224\241\241, \234\238\242\238\240\251\233 \226\251 \239\238\230\229\235\224\229\242\229. \194\251 \228\238\235\230\237\251 \225\243\228\229\242\229 \239\240\238\233\242\232 \237\229\225\238\235\252\248\238\229 \232\241\239\251\242\224\237\232\229, \247\242\238\225\251 \239\238\235\243\247\232\242 \234\235\224\241\241." )
	--TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    Я верю, что вы понимаете основную систему боя. Теперь настало время, чтобы выбрать класс. Руководство Новичка будет рекомендовать вам соответствующих тренеров. Идите к Наставнице сейчас и выберите класс, который вы пожелаете. Вы должны будете пройти небольшое испытание, чтобы получит класс." )
	RegTrigger( 60002, 1 )
	
	InitTrigger()
	TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    \207\238\231\228\240\224\226\235\255\229\236! \194\251 \228\238\241\242\232\227\235\232 10 \243\240\238\226\237\255. \194\251 \239\238\235\243\247\232\235\232 \226\224\248\229 \239\229\240\226\238\229 \238\247\234\238 \237\224\226\251\234\224. \202\224\230\228\251\233 \243\240\238\226\229\237\252 \242\229\239\229\240\252 \239\238\231\226\238\235\232\242 \239\238\235\243\247\232\242\252 \238\247\234\238 \237\224\226\251\234\224. \194\251 \236\238\230\229\242\229 \232\231\243\247\224\242\252 \237\238\226\251\229 \237\224\226\251\234\232 \239\238\241\235\229 \239\238\235\243\247\229\237\232\255 \239\240\238\244\229\241\232\232. \208\224\231\235\232\247\237\251\229 \237\224\226\251\234\232 \239\240\238\228\224\254\242\241\255 \243 \225\224\234\224\235\229\233\249\232\234\224 \226 \235\254\225\238\236 \227\238\240\238\228\229!" )
	--TriggerAction( 1, HelpInfo,MIS_HELP_DESP,"    Поздравляем! Вы достигли 10 уровня. Вы получили ваше первое очко навыка. Каждый уровень теперь позволит получить очко навыка. Вы можете изучать новые навыки после получения професии. Различные навыки продаются у бакалейщика в любом городе!" )
	RegTrigger( 60003, 1 )

	InitTrigger () 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 \241 45 \243\240\238\226\237\229\236!") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас с 45 уровнем!") 
	RegTrigger (60004, 1) 

	InitTrigger () 
	TriggerAction (1, GiveMGHZ, 0,1,0) 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 \241 25 \243\240\238\226\237\229\236! \210\229\239\229\240\252 \226\251 \236\238\230\229\242\229 \241\240\224\230\224\242\252\241\255 \237\224 \224\240\229\237\229, \234\243\239\232\226 \231\224\238\228\237\238 \236\229\228\224\235\252 \238\242\226\224\227\232.") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас с 25 уровнем! Теперь вы можете сражаться на арене, купив заодно медаль отваги.") 
	RegTrigger (60005, 1) 
 
	InitTrigger () 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 \241 30 \243\240\238\226\237\229\236! \194\251 \236\238\230\229\242\229 \245\238\228\232\242\252 \226 \199\224\225\251\242\251\233 \195\238\240\238\228.") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас с 30 уровнем! Вы можете ходить в Забытый Город.") 
	RegTrigger (60006, 1) 
 
 
	InitTrigger () 
	TriggerAction (1, GiveMGHZ, 0,3,0) 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 \241 35 \243\240\238\226\237\229\236!") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас с 35 уровнем!") 
	RegTrigger (60007, 1) 
 
	InitTrigger () 
	TriggerAction (1, GiveMGHZ, 0,5,0) 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 \241 40 \243\240\238\226\237\229\236! \194\251 \236\238\230\229\242\229 \245\238\228\232\242\252 \226 \210\229\236\237\243\254 \210\238\239\252.") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас с 40 уровнем! Вы можете ходить в Темную Топь.") 
	RegTrigger (60008, 1) 
 
	InitTrigger () 
	TriggerAction (1, GiveMGHZ, 0,9,0) 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 45 \243\240\238\226\237\229\236!") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас 45 уровнем!") 
	RegTrigger (60009, 1) 

 
	InitTrigger () 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\207\238\231\228\240\224\226\235\255\229\236 \194\224\241 \241 41 \243\240\238\226\237\229\236! \210\229\239\229\240\252 \194\251 \236\238\230\229\242\229 \225\240\224\242\252 \254\237\251\245 \239\232\240\224\242\238\226 \226 \243\247\229\237\232\234\232.") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "Поздравляем Вас с 41 уровнем! Теперь Вы можете брать юных пиратов в ученики.") 
	RegTrigger (60011, 1) 
 
	InitTrigger () 
	TriggerAction (1, HelpInfo, MIS_HELP_DESP, "\194 \192\240\227\229\237\242\229 \237\224 \192\240\229\237\229, \237\224 \226\241\229 \194\224\248\232 \226\238\239\240\238\241\251 \236\238\230\229\242 \238\242\226\229\242\232\242\252 \194\224\236 \207\252\255\237\232\246\224 - \192\237\242\238\237\232\233.") 
	--TriggerAction (1, HelpInfo, MIS_HELP_DESP, "В Аргенте на Арене, на все Ваши вопросы может ответить Вам Пьяница - Антоний.") 
	RegTrigger (60012, 1) 

end
PCBorn()
