-------------------------------------------------------------------------

-- Переведено и отредактировано пользователем eXtaZy aka BopoHangel  --

-------------------------------------------------------------------------
print( "‡ Јаг§Є  NPCScript02.lua")


function GoToWhere() 

	
	--local ReSelectTalk = "Мне нужно подумать."
	local ReSelectTalk = "\204\237\229 \237\243\230\237\238 \239\238\228\243\236\224\242\252."
	local ReSelectPage = 1

	
	--local CancelSelectTalk = "Забудь! Я останусь тут."
	local CancelSelectTalk = "\199\224\225\243\228\252! \223 \238\241\242\224\237\243\241\252 \242\243\242."
	local CancelSelectPage = 2

	-- (Список локаций используемый портальщиком) 
	local CurMapName1 = "garner"     -- Аскарон
	local CurMapName2 = "magicsea"   -- Магический Океан
	local CurMapName3 = "eastgoaf"   -- Серебрянные Шахты,Логово Черного Дракона...
	local CurMapName4 = "lonetower"  -- Одинокая Башня
	local CurMapName5 = "darkblue"   -- Великий Синий Океан

	-- Аскарон
	local GoTo01X = 2231             -- Координата (X)
	local GoTo01Y = 2788             -- Координата (Y)
	local GoTo01M = CurMapName1

	-- Магический Океан
	local GoTo02X = 890
	local GoTo02Y = 3575
	local GoTo02M = CurMapName2

	-- Аскарон
	local GoTo03X = 735
	local GoTo03Y = 1590
	local GoTo03M = CurMapName1

	-- Великий Синий Океан
	local GoTo04X = 1318
	local GoTo04Y = 510
	local GoTo04M = CurMapName5

	-- Аскарон
	local GoTo05X = 633
	local GoTo05Y = 2100
	local GoTo05M = CurMapName1

	-- Аскарон
	local GoTo06X = 1007
	local GoTo06Y = 2966
	local GoTo06M = CurMapName1

	-- Аскарон
	local GoTo07X = 1507
	local GoTo07Y = 2039
	local GoTo07M = CurMapName1

	-- Аскарон
	local GoTo08X = 1711
	local GoTo08Y = 3448
	local GoTo08M = CurMapName1

	-- Аскарон
	local GoTo09X = 2501
	local GoTo09Y = 2997
	local GoTo09M = CurMapName1

	-- Аскарон
	local GoTo10X = 3197
	local GoTo10Y = 1254
	local GoTo10M = CurMapName1

-- Портальщик Аргента

	--Talk( 1, "Джовиал: Привет! Я портальщик Аргента! Чем я могу помочь тебе?" )
	Talk( 1, "\196\230\238\226\232\224\235: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \192\240\227\229\237\242\224! \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
    --Text( 1, "Купить Билет", BuyPage )
    Text( 1, "\202\243\239\232\242\252 \193\232\235\229\242", BuyPage )
	--Text( 1, "Отправиться в Ледынь", JumpPage, 7 )
	Text( 1, "\206\242\239\240\224\226\232\242\252\241\255 \226 \203\229\228\251\237\252", JumpPage, 7 )
	--Text( 1, "Отправиться в Шайтан", JumpPage, 5 )
	Text( 1, "\206\242\239\240\224\226\232\242\252\241\255 \226 \216\224\233\242\224\237", JumpPage, 5 )
	--Text( 1, "Отправиться в Громоград", JumpPage, 6 )
	Text( 1, "\206\242\239\240\224\226\232\242\252\241\255 \226 \195\240\238\236\238\227\240\224\228", JumpPage, 6 )
	--Text( 1, "Записать точку возрождения", JumpPage, 24 )
	Text( 1, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 24 )
	
	--Talk( 2, "Запомни где меня искать, когда тебе понадобяться услуги телепортации, приходи я помогу!", CloseTalk )
	Talk( 2, "\199\224\239\238\236\237\232 \227\228\229 \236\229\237\255 \232\241\234\224\242\252, \234\238\227\228\224 \242\229\225\229 \239\238\237\224\228\238\225\255\242\252\241\255 \243\241\235\243\227\232 \242\229\235\229\239\238\240\242\224\246\232\232, \239\240\232\245\238\228\232 \255 \239\238\236\238\227\243!", CloseTalk )


	
	InitTrigger()
	TriggerCondition( 1, LvCheck, "<", 11 )
	TriggerAction( 1, GoTo, GoTo01X, GoTo01Y, GoTo01M )
	TriggerCondition( 2, HasMoney, 500 )
	TriggerAction( 2, TakeMoney, 500 )
	TriggerAction( 2, GoTo, GoTo01X, GoTo01Y, GoTo01M )
	TriggerFailure( 2, JumpPage, 23 )
	--Talk( 4, "Отправить в Аргент? Нет проблем! Заплати (500) Зол. Бесплатным сервисом могут пользоваться игроки не старше 10 уровня!" )
	Talk( 4, "\206\242\239\240\224\226\232\242\252 \226 \192\240\227\229\237\242? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (500) \199\238\235. \193\229\241\239\235\224\242\237\251\236 \241\229\240\226\232\241\238\236 \236\238\227\243\242 \239\238\235\252\231\238\226\224\242\252\241\255 \232\227\240\238\234\232 \237\229 \241\242\224\240\248\229 10 \243\240\238\226\237\255!" )
	--Text( 4, "Отправиться",MultiTrigger, GetMultiTrigger(), 2 ) 
	Text( 4, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 2 ) 
	Text( 4, CancelSelectTalk, JumpPage , CancelSelectPage )


	InitTrigger()
	TriggerCondition( 1, LvCheck, "<", 11 )
	TriggerAction( 1, GoTo, GoTo02X, GoTo02Y, GoTo02M )
	TriggerCondition( 2, HasMoney, 500 )
	TriggerAction( 2, TakeMoney, 500 )
	TriggerAction( 2,  GoTo, GoTo02X, GoTo02Y, GoTo02M )
	TriggerFailure( 2, JumpPage, 23 )
	--Talk( 5, "Я так люблю Шайтан! Заплати (500) Зол. Бесплатным сервисом могут пользоваться игроки не старше 10 уровня!" )
	Talk( 5, "\223 \242\224\234 \235\254\225\235\254 \216\224\233\242\224\237! \199\224\239\235\224\242\232 (500) \199\238\235. \193\229\241\239\235\224\242\237\251\236 \241\229\240\226\232\241\238\236 \236\238\227\243\242 \239\238\235\252\231\238\226\224\242\252\241\255 \232\227\240\238\234\232 \237\229 \241\242\224\240\248\229 10 \243\240\238\226\237\255!" )
	--Text( 5, "Отправиться",MultiTrigger, GetMultiTrigger(), 2)
	Text( 5, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 2)
	Text( 5, CancelSelectTalk, JumpPage , CancelSelectPage )


	InitTrigger()
	TriggerCondition( 1, LvCheck, "<", 11 )
	TriggerAction( 1, GoTo, GoTo03X, GoTo03Y, GoTo03M )
	TriggerCondition( 2, HasMoney, 500 )
	TriggerAction( 2, TakeMoney, 500 )
	TriggerAction( 2,  GoTo, GoTo03X, GoTo03Y, GoTo03M )
	TriggerFailure( 2, JumpPage, 23 )
	--Talk( 6, "Отправить в Громоград? Нет проблем! Заплати (500) Зол. Бесплатным сервисом могут пользоваться игроки не старше 10 уровня!" )
	Talk( 6, "\206\242\239\240\224\226\232\242\252 \226 \195\240\238\236\238\227\240\224\228? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (500) \199\238\235. \193\229\241\239\235\224\242\237\251\236 \241\229\240\226\232\241\238\236 \236\238\227\243\242 \239\238\235\252\231\238\226\224\242\252\241\255 \232\227\240\238\234\232 \237\229 \241\242\224\240\248\229 10 \243\240\238\226\237\255!" )
	--Text( 6, "Отправиться",MultiTrigger, GetMultiTrigger(), 2 )
	Text( 6, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 2 )
	Text( 6, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, LvCheck, "<", 11 )
	TriggerAction( 1, GoTo, GoTo04X, GoTo04Y, GoTo04M )
	TriggerCondition( 2, HasMoney, 500 )
	TriggerAction( 2, TakeMoney, 500 )
	TriggerAction( 2, GoTo, GoTo04X, GoTo04Y, GoTo04M )
	TriggerFailure( 2, JumpPage, 23 )
	--Talk( 7, "Отправить в Ледынь? Нет проблем! Заплати (500) Зол. Бесплатным сервисом могут пользоваться игроки не старше 10 уровня!" )
	Talk( 7, "\206\242\239\240\224\226\232\242\252 \226 \203\229\228\251\237\252? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (500) \199\238\235. \193\229\241\239\235\224\242\237\251\236 \241\229\240\226\232\241\238\236 \236\238\227\243\242 \239\238\235\252\231\238\226\224\242\252\241\255 \232\227\240\238\234\232 \237\229 \241\242\224\240\248\229 10 \243\240\238\226\237\255!" )
	--Text( 7, "Отправить",MultiTrigger, GetMultiTrigger(), 2)
	Text( 7, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 2)
	Text( 7, CancelSelectTalk, JumpPage , CancelSelectPage )

-- Портальщик Шайтана

	--Talk( 18, "Мэй: Привет! Я портальщик Шайтана! Чем я могу помочь тебе?" )
	Talk( 18, "\204\253\233: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \216\224\233\242\224\237\224! \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
        --Text( 18, "Купить Билет", BuyPage )
        Text( 18, "\202\243\239\232\242\252 \193\232\235\229\242", BuyPage )
	--Text( 18, "Отправиться в Аргент", JumpPage, 4 )
	Text( 18, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 4 )
	--Text( 18, "Отправиться в Ледынь", JumpPage, 7 )
	Text( 18, "\206\242\239\240\224\226\232\242\252\241\255 \226 \203\229\228\251\237\252", JumpPage, 7 )
	--Text( 18, "Отправиться в Громоград", JumpPage, 6 )
	Text( 18, "\206\242\239\240\224\226\232\242\252\241\255 \226 \195\240\238\236\238\227\240\224\228", JumpPage, 6 )
	--Text( 18, "Записать точку возрождения", JumpPage, 25 )
	Text( 18, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )

-- Портальщик Громограда

	--Talk( 19, "Сара: Привет! Я портальщик Громограда. Чем я могу помочь тебе?" )
	Talk( 19, "\209\224\240\224: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \195\240\238\236\238\227\240\224\228\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 19, "Отправиться в Аргент", JumpPage, 4 )
	Text( 19, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 4 )
	--Text( 19, "Отправиться в Ледынь", JumpPage, 7 )
	Text( 19, "\206\242\239\240\224\226\232\242\252\241\255 \226 \203\229\228\251\237\252", JumpPage, 7 )
	--Text( 19, "Отправиться в Шайтан", JumpPage, 5 )
	Text( 19, "\206\242\239\240\224\226\232\242\252\241\255 \226 \216\224\233\242\224\237", JumpPage, 5 )
	--Text( 19, "Записать точку возрождения", JumpPage, 26 )
	Text( 19, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 26 )

-- Портальщик Ледыни

	--Talk( 20, "Хелен: Привет! Я портальщик Ледыни. Чем я могу помочь тебе?" )
	Talk( 20, "\213\229\235\229\237: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \203\229\228\251\237\232. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
        --Text( 20, "Купить Билет", BuyPage )
        Text( 20, "\202\243\239\232\242\252 \193\232\235\229\242", BuyPage )
	--Text( 20, "Отправиться в Аргент", JumpPage, 4 )
	Text( 20, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 4 )
	--Text( 20, "Отправиться в Шайтан", JumpPage, 5 )
	Text( 20, "\206\242\239\240\224\226\232\242\252\241\255 \226 \216\224\233\242\224\237", JumpPage, 5 )
	--Text( 20, "Отправиться в Громоград", JumpPage, 6 )
	Text( 20, "\206\242\239\240\224\226\232\242\252\241\255 \226 \195\240\238\236\238\227\240\224\228", JumpPage, 6 )
	--Text( 20, "Записать точку возрождения", JumpPage, 27 )
	Text( 20, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 27 )


	--Talk( 23, "Извини! У тебя не хватает золота для телепортации." )
	Talk( 23, "\200\231\226\232\237\232! \211 \242\229\225\255 \237\229 \245\226\224\242\224\229\242 \231\238\235\238\242\224 \228\235\255 \242\229\235\229\239\238\240\242\224\246\232\232." )

	--Talk( 24, "Джовиал: Записать точку возрождения в Аргенте?" )
	Talk( 24, "\196\230\238\226\232\224\235: \199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255 \226 \192\240\227\229\237\242\229?" )
	--Text( 24, "Да. Пожалуйста запиши", SetSpawnPos, "Аргент" )
	Text( 24, "\196\224. \207\238\230\224\235\243\233\241\242\224 \231\224\239\232\248\232", SetSpawnPos, "\192\240\227\229\237\242" )
	--Text( 24, "Нет, спасибо",CloseTalk )
	Text( 24, "\205\229\242, \241\239\224\241\232\225\238",CloseTalk )

	--Talk( 25, "Мэй: Записать точку возрождения в Шайтане?" )
	Talk( 25, "\204\253\233: \199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255 \226 \216\224\233\242\224\237\229?" )
	--Text( 25, "Да. Пожалуйста запиши", SetSpawnPos, "Шайтан" )
	Text( 25, "\196\224. \207\238\230\224\235\243\233\241\242\224 \231\224\239\232\248\232", SetSpawnPos, "\216\224\233\242\224\237" )
	--Text( 25, "Нет, спасибо",CloseTalk )
	Text( 25, "\205\229\242, \241\239\224\241\232\225\238",CloseTalk )

	--Talk( 26, "Сара: Записать точку возрождения в Громограде?" )
	Talk( 26, "\209\224\240\224: \199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255 \226 \195\240\238\236\238\227\240\224\228\229?" )
	--Text( 26, "Да. Пожалуйста запиши", SetSpawnPos, "Громоград" )
	Text( 26, "\196\224. \207\238\230\224\235\243\233\241\242\224 \231\224\239\232\248\232", SetSpawnPos, "\195\240\238\236\238\227\240\224\228" )
	--Text( 26, "Нет, спасибо",CloseTalk )
	Text( 26, "\205\229\242, \241\239\224\241\232\225\238",CloseTalk )

	--Talk( 27, "Хелен: Записать точку возрождения в Ледыне?" )
	Talk( 27, "\213\229\235\229\237: \199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255 \226 \203\229\228\251\237\229?" )
	--Text( 27, "Да. Пожалуйста запиши", SetSpawnPos, "Ледынь" )
	Text( 27, "\196\224. \207\238\230\224\235\243\233\241\242\224 \231\224\239\232\248\232", SetSpawnPos, "\203\229\228\251\237\252" )
	--Text( 27, "Нет, спасибо",CloseTalk )
	Text( 27, "\205\229\242, \241\239\224\241\232\225\238",CloseTalk )

	InitTrade()
        Other(0332) -- Билет на о. Весны
        Other(0563) -- Пропуск на остров Лета
        Other(0583) -- Пропуск на остров Осени
        Other(3054) -- Пропуск в Одинокую башню
        Other(2491) -- Пропуск на Базу Флота
        Other(2447) -- Пропуск на Остров Скелетов
        Other(3050) -- Пропуск к Священной Снежной горе

 


	InitTrigger()

	TriggerCondition( 1, IsMapNpc, "garner", 0 )
	TriggerAction( 1, JumpPage, 1 )

	TriggerCondition( 2, IsMapNpc, "magicsea", 0 )
	TriggerAction( 2, JumpPage, 18 )

	TriggerCondition( 3, IsMapNpc, "garner", 43 )
	TriggerAction( 3, JumpPage, 19 )

	TriggerCondition( 4, IsMapNpc, "darkblue", 12 )
	TriggerAction( 4, JumpPage, 20 )

	TriggerCondition( 5, IsMapNpc, "darkblue", 15 )
	TriggerAction( 5, JumpPage, 28 )

	Start( GetMultiTrigger(), 5 )

end

-- Портальщики Области

function transmittal() -- Функция Нипа

	
	--local ReSelectTalk = "Мне нужно подумать."
	local ReSelectTalk = "\204\237\229 \237\243\230\237\238 \239\238\228\243\236\224\242\252."
	local ReSelectPage = 1

	
	--local CancelSelectTalk = "Забудь! Я останусь тут."
	local CancelSelectTalk = "\199\224\225\243\228\252! \223 \238\241\242\224\237\243\241\252 \242\243\242."
	local CancelSelectPage = 27

	-- (Список локаций используемый портальщиком)
	local CurMapName1 = "garner"     -- Аскарон
	local CurMapName2 = "magicsea"   -- Магический Океан
	local CurMapName3 = "eastgoaf"   -- Серебрянные Шахты,Логово Черного Дракона...
	local CurMapName4 = "lonetower"  -- Одинокая Башня
	local CurMapName5 = "darkblue"   -- Великий Синий Океан

	-- Аскарон
	local GoTo01X = 1903             -- Координата (Х)
	local GoTo01Y = 2807             -- Координата (Y)
	local GoTo01M = CurMapName1

	-- Аскарон
	local GoTo02X = 1517
	local GoTo02Y = 3091
	local GoTo02M = CurMapName1

	-- Аскарон
	local GoTo03X = 1120
	local GoTo03Y = 2773
	local GoTo03M = CurMapName1

	-- Аскарон
	local GoTo04X = 535
	local GoTo04Y = 2433
	local GoTo04M = CurMapName1

	-- Аскарон
	local GoTo05X = 633
	local GoTo05Y = 2100
	local GoTo05M = CurMapName1

	-- Аскарон
	local GoTo06X = 1007
	local GoTo06Y = 2966
	local GoTo06M = CurMapName1

	-- Магический Океан
	local GoTo07X = 787
	local GoTo07Y = 3121
	local GoTo07M = CurMapName2

	-- Магический Океан
	local GoTo08X = 1214
	local GoTo08Y = 3203
	local GoTo08M = CurMapName2

	-- Великий Синий Океан
	local GoTo09X = 807
	local GoTo09Y = 360
	local GoTo09M = CurMapName5

	-- Великий Синий Океан
	local GoTo10X = 1050
	local GoTo10Y = 656
	local GoTo10M = CurMapName5

	-- Великий Синий Океан
	local GoTo11X = 2146
	local GoTo11Y = 542
	local GoTo11M = CurMapName5

	-- Великий Синий Океан
	local GoTo12X = 2681
	local GoTo12Y = 647
	local GoTo12M = CurMapName5

	--Talk( 1, "Мия: Привет! Я портальщик Мия. Чем я могу помочь тебе?" )
	Talk( 1, "\204\232\255: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \204\232\255. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 1, "Отправиться в Скалистый Удел", JumpPage, 14 )
	Text( 1, "\206\242\239\240\224\226\232\242\252\241\255 \226 \209\234\224\235\232\241\242\251\233 \211\228\229\235", JumpPage, 14 )
	--Text( 1, "Записать точку возрождения", JumpPage, 25 )	
	Text( 1, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )	
	
	--Talk( 2, "Фелиция: Привет! Я портальщик Фелиция. Чем я могу помочь тебе?" )
	Talk( 2, "\212\229\235\232\246\232\255: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \212\229\235\232\246\232\255. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 2, "Отправиться в Андийский Лес", JumpPage, 18 )
	Text( 2, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\237\228\232\233\241\234\232\233 \203\229\241", JumpPage, 18 )
	--Text( 2, "Отправиться в Заброшенные Шахты", JumpPage, 13 )
	Text( 2, "\206\242\239\240\224\226\232\242\252\241\255 \226 \199\224\225\240\238\248\229\237\237\251\229 \216\224\245\242\251", JumpPage, 13 )
	--Text( 2, "Записать точку возрождения", JumpPage, 25 )	
	Text( 2, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 3, "Венди: Привет! Я портальщик Венди. Чем я могу помочь тебе?" )
	Talk( 3, "\194\229\237\228\232: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \194\229\237\228\232. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 3, "Отправиться в Валгалу", JumpPage, 15 )
	Text( 3, "\206\242\239\240\224\226\232\242\252\241\255 \226 \194\224\235\227\224\235\243", JumpPage, 15 )
	--Text( 3, "Отправиться в Скалистый Удел", JumpPage, 14 )
	Text( 3, "\206\242\239\240\224\226\232\242\252\241\255 \226 \209\234\224\235\232\241\242\251\233 \211\228\229\235", JumpPage, 14 )
	--Text( 3, "Записать точку возрождения", JumpPage, 25 )	
	Text( 3, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 4, "Элизабет: Привет! Я портальщик Элизабет. Чем я могу помочь тебе?" )
	Talk( 4, "\221\235\232\231\224\225\229\242: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \221\235\232\231\224\225\229\242. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 4, "Отправиться в Обитель Радости", JumpPage, 16 )
	Text( 4, "\206\242\239\240\224\226\232\242\252\241\255 \226 \206\225\232\242\229\235\252 \208\224\228\238\241\242\232", JumpPage, 16 )
	--Text( 4, "Отправиться в Андийский Лес", JumpPage, 18 )
	Text( 4, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\237\228\232\233\241\234\232\233 \203\229\241", JumpPage, 18 )
	--Text( 4, "Записать точку возрождения", JumpPage, 25 )	
	Text( 4, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 5, "Мейла: Привет! Я портальщик Мейла. Чем я могу помочь тебе?" )
	Talk( 5, "\204\229\233\235\224: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \204\229\233\235\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 5, "Отправиться в Халдейский Оплот", JumpPage, 17 )
	Text( 5, "\206\242\239\240\224\226\232\242\252\241\255 \226 \213\224\235\228\229\233\241\234\232\233 \206\239\235\238\242", JumpPage, 17 )
	--Text( 5, "Отправиться в Валгалу", JumpPage, 15 )
	Text( 5, "\206\242\239\240\224\226\232\242\252\241\255 \226 \194\224\235\227\224\235\243", JumpPage, 15 )
	--Text( 5, "Записать точку возрождения", JumpPage, 25 )
	Text( 5, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 6, "Мабел: Привет! Я портальщик Мабел. Чем я могу помочь тебе?" )
	Talk( 6, "\204\224\225\229\235: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \204\224\225\229\235. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 6, "Отправиться в Обитель Радости", JumpPage, 16 )
	Text( 6, "\206\242\239\240\224\226\232\242\252\241\255 \226 \206\225\232\242\229\235\252 \208\224\228\238\241\242\232", JumpPage, 16 )
	--Text( 6, "Записать точку возрождения", JumpPage, 25 )	
	Text( 6, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 7, "Аина: Привет! Я портальщик Аина. Чем я могу помочь тебе?" )
	Talk( 7, "\192\232\237\224: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \192\232\237\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 7, "Отправиться в Рощу Акаций", JumpPage, 20 )
	Text( 7, "\206\242\239\240\224\226\232\242\252\241\255 \226 \208\238\249\243 \192\234\224\246\232\233", JumpPage, 20 )
	--Text( 7, "Записать точку возрождения", JumpPage, 25 )	
	Text( 7, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 8, "Берлин: Привет! Я портальщик Берлин. Чем я могу помочь тебе?" )
	Talk( 8, "\193\229\240\235\232\237: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \193\229\240\235\232\237. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 8, "Отправиться в Гавань Оазиса", JumpPage, 19 )
	Text( 8, "\206\242\239\240\224\226\232\242\252\241\255 \226 \195\224\226\224\237\252 \206\224\231\232\241\224", JumpPage, 19 )
	--Text( 8, "Записать точку возрождения", JumpPage, 25 )		
	Text( 8, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 9, "Лилу: Привет! Я портальщик Лилу. Чем я могу помочь тебе?" )
	Talk( 9, "\203\232\235\243: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \203\232\235\243. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 9, "Отправиться в Бухту Атлантис", JumpPage, 22 )
	Text( 9, "\206\242\239\240\224\226\232\242\252\241\255 \226 \193\243\245\242\243 \192\242\235\224\237\242\232\241", JumpPage, 22 )
	--Text( 9, "Записать точку возрождения", JumpPage, 25 )		
	Text( 9, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		


	--Talk( 10, "София: Привет! Я портальщик София. Чем я могу помочь тебе?" )
	Talk( 10, "\209\238\244\232\255: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \209\238\244\232\255. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 10, "Отправиться на Берег Скелетов", JumpPage, 23 )
	Text( 10, "\206\242\239\240\224\226\232\242\252\241\255 \237\224 \193\229\240\229\227 \209\234\229\235\229\242\238\226", JumpPage, 23 )
	--Text( 10, "Отправиться в Пустоши Ледыни", JumpPage, 21 )
	Text( 10, "\206\242\239\240\224\226\232\242\252\241\255 \226 \207\243\241\242\238\248\232 \203\229\228\251\237\232", JumpPage, 21 )
	--Text( 10, "Записать точку возрождения", JumpPage, 25 )	
	Text( 10, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 11, "Мина: Привет! Я портальщик Мина. Чем я могу помочь тебе?" )
	Talk( 11, "\204\232\237\224: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \204\232\237\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 11, "Отправиться на Ледяной Шип", JumpPage, 24 )
	Text( 11, "\206\242\239\240\224\226\232\242\252\241\255 \237\224 \203\229\228\255\237\238\233 \216\232\239", JumpPage, 24 )
	--Text( 11, "Отправиться в Бухту Атлантис", JumpPage, 22 )
	Text( 11, "\206\242\239\240\224\226\232\242\252\241\255 \226 \193\243\245\242\243 \192\242\235\224\237\242\232\241", JumpPage, 22 )
	--Text( 11, "Записать точку возрождения", JumpPage, 25 )	
	Text( 11, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 12, "Артемис: Привет! Я портальщик Артемис. Чем я могу помочь тебе?" )
	Talk( 12, "\192\240\242\229\236\232\241: \207\240\232\226\229\242! \223 \239\238\240\242\224\235\252\249\232\234 \192\240\242\229\236\232\241. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 12, "Отправиться на Берег Скелетов", JumpPage, 23 )
	Text( 12, "\206\242\239\240\224\226\232\242\252\241\255 \237\224 \193\229\240\229\227 \209\234\229\235\229\242\238\226", JumpPage, 23 )
	--Text( 12, "Записать точку возрождения", JumpPage, 25 )	
	Text( 12, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		
	
	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo01X, GoTo01Y, GoTo01M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 13, "Отправить в Заброшенные Шахты? Нет проблем! Заплати (200) золотых!" )
	Talk( 13, "206\242\239\240\224\226\232\242\252 \226 \199\224\225\240\238\248\229\237\237\251\229 \216\224\245\242\251? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 13, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 13, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 13, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo02X, GoTo02Y, GoTo02M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 14, "Отправить в Скалистый Удел? Нет проблем! Заплати (200) золотых!" )
	Talk( 14, "\206\242\239\240\224\226\232\242\252 \226 \209\234\224\235\232\241\242\251\233 \211\228\229\235? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 14, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 14, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 14, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo03X, GoTo03Y, GoTo03M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 15, "Отправить в Валгалу? Нет проблем! Заплати (200) золотых!" )
	Talk( 15, "\206\242\239\240\224\226\232\242\252 \226 \194\224\235\227\224\235\243? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 15, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 15, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 15, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo04X, GoTo04Y, GoTo04M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 16, "Отправить в Обитель Радости? Нет проблем! Заплати (200) золотых!" )
	Talk( 16, "\206\242\239\240\224\226\232\242\252 \226 \206\225\232\242\229\235\252 \208\224\228\238\241\242\232? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 16, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 16, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 16, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo05X, GoTo05Y, GoTo05M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 17, "Отправить в Халдейский Оплот? Нет проблем! Заплати (200) золотых!" )
	Talk( 17, "\206\242\239\240\224\226\232\242\252 \226 \213\224\235\228\229\233\241\234\232\233 \206\239\235\238\242? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 17, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 17, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 17, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo06X, GoTo06Y, GoTo06M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 18, "Отправить в Андийский Лес? Нет проблем! Заплати (200) золотых!" )
	Talk( 18, "\206\242\239\240\224\226\232\242\252 \226 \192\237\228\232\233\241\234\232\233 \203\229\241? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 18, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 18, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 18, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo07X, GoTo07Y, GoTo07M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 19, "Отправить в Гавань Оазиса? Нет проблем! Заплати (200) золотых!" )
	Talk( 19, "\206\242\239\240\224\226\232\242\252 \226 \195\224\226\224\237\252 \206\224\231\232\241\224? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 19, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 19, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 19, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo08X, GoTo08Y, GoTo08M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 20, "Отправить в Рощу Акаций? Нет проблем! Заплати (200) золотых!" )
	Talk( 20, "\206\242\239\240\224\226\232\242\252 \226 \208\238\249\243 \192\234\224\246\232\233? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 20, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 20, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 20, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo09X, GoTo09Y, GoTo09M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 21, "Отправить в Пустоши Ледыни? Нет проблем! Заплати (200) золотых!" )
	Talk( 21, "\206\242\239\240\224\226\232\242\252 \226 \207\243\241\242\238\248\232 \203\229\228\251\237\232? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 21, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 21, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 21, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo10X, GoTo10Y, GoTo10M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 22, "Отправить в Бухту Атлантис? Нет проблем! Заплати (200) золотых!" )
	Talk( 22, "\206\242\239\240\224\226\232\242\252 \226 \193\243\245\242\243 \192\242\235\224\237\242\232\241? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 22, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 22, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 22, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo11X, GoTo11Y, GoTo11M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 23, "Отправить на Берег Скелетов? Нет проблем! Заплати (200) золотых!" )
	Talk( 23, "\206\242\239\240\224\226\232\242\252 \237\224 \193\229\240\229\227 \209\234\229\235\229\242\238\226? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 23, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 23, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 23, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 200 )
	TriggerAction( 1, TakeMoney, 200 )
	TriggerAction( 1, GoTo, GoTo12X, GoTo12Y, GoTo12M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 24, "Отправить на Ледяной Шип? Нет проблем! Заплати (200) золотых!" )
	Talk( 24, "\206\242\239\240\224\226\232\242\252 \237\224 \203\229\228\255\237\238\233 \216\232\239? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (200) \231\238\235\238\242\251\245!" )
	--Text( 24, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 24, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 24, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, IsMapNpc, "garner", 96 )
	TriggerAction( 1, SetSpawnPos, "\199\224\225\240\238\248\229\237\237\251\229 \248\224\245\242\251")
	--TriggerAction( 1, SetSpawnPos, "\199\224\225\240\238\248\229\237\237\251\229 \216\224\245\242\251") -- Заброшенные Шахты
	TriggerCondition( 2, IsMapNpc, "garner", 94 )
	TriggerAction( 2, SetSpawnPos, "\209\234\224\235\232\241\242\251\233 \243\228\229\235")
	--TriggerAction( 2, SetSpawnPos, "\209\234\224\235\232\241\242\251\233 \211\228\229\235") -- Скалистый Удел
	TriggerCondition( 3, IsMapNpc, "garner", 95 )
	TriggerAction( 3, SetSpawnPos, "\194\224\235\227\224\235\235\224")
	--TriggerAction( 3, SetSpawnPos, "\194\224\235\227\224\235\224") -- Валгала
	TriggerCondition( 4, IsMapNpc, "garner", 97 )
	TriggerAction( 4, SetSpawnPos, "\206\225\232\242\229\235\252 \208\224\228\238\241\242\232")
	--TriggerAction( 4, SetSpawnPos, "\206\225\232\242\229\235\252 \208\224\228\238\241\242\232") -- Обитель Радости
	TriggerCondition( 5, IsMapNpc, "garner", 55 )
	TriggerAction( 5, SetSpawnPos, "\213\224\235\228\229\233\241\234\224\255 \227\224\226\224\237\252")
	--TriggerAction( 5, SetSpawnPos, "\213\224\235\228\229\233\241\234\232\233 \206\239\235\238\242") -- Халдейский Оплот
	TriggerCondition( 6, IsMapNpc, "garner", 56 )
	TriggerAction( 6, SetSpawnPos, "\192\237\228\232\233\241\234\232\233 \235\229\241")
	--TriggerAction( 6, SetSpawnPos, "\192\237\228\232\233\241\234\232\233 \203\229\241") -- Андийский Лес
	TriggerCondition( 7, IsMapNpc, "magicsea", 50 )
	TriggerAction( 7, SetSpawnPos, "\195\224\226\224\237\252 \206\224\231\232\241\224")
	--TriggerAction( 7, SetSpawnPos, "Oasis Haven(\195\224\226\224\237\252 \206\224\231\232\241\224") -- Гавань Оазиса
	TriggerCondition( 8, IsMapNpc, "magicsea", 46 )
	TriggerAction( 8, SetSpawnPos, "\207\238\241\229\235\229\237\232\229 \226 \239\243\241\242\251\237\232")
	--TriggerAction( 8, SetSpawnPos, "\208\238\249\224 \192\234\224\246\232\233") -- Роща Акаций
	TriggerCondition( 9, IsMapNpc, "darkblue", 56 )
	TriggerAction( 9, SetSpawnPos, "\203\229\228\255\237\224\255 \227\224\226\224\237\252")
	--TriggerAction( 9, SetSpawnPos, "\207\243\241\242\238\248\232 \203\229\228\251\237\232") -- Пустоши Ледыни
	TriggerCondition( 10, IsMapNpc, "darkblue", 42 )
	TriggerAction( 10, SetSpawnPos, "\193\243\245\242\224 \192\242\235\224\237\242\232\241")
	--TriggerAction( 10, SetSpawnPos, "\193\243\245\242\224 \192\242\235\224\237\242\232\241") -- Бухта Атлантис
	TriggerCondition( 11, IsMapNpc, "darkblue", 46 )
	TriggerAction( 11, SetSpawnPos, "\193\229\240\229\227 \209\234\229\235\229\242\238\226")
	--TriggerAction( 11, SetSpawnPos, "\193\229\240\229\227 \209\234\229\235\229\242\238\226") -- Берег Скелетов
	TriggerCondition( 12, IsMapNpc, "darkblue", 51 )
	TriggerAction( 12, SetSpawnPos, "\203\229\228\255\237\238\233 \248\232\239")
	--TriggerAction( 12, SetSpawnPos, "\203\229\228\255\237\238\233 \216\232\239") -- Ледяной Шип
	TriggerFailure( 12, JumpPage, 28 )
	--Talk( 25, "Хочешь записать точку возраждения здесь?" )
	Talk( 25, "\213\238\247\229\248\252 \231\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\224\230\228\229\237\232\255 \231\228\229\241\252?" )
	--Text( 25, "Да. Пожалуйста запиши", MultiTrigger, GetMultiTrigger(), 12 )
	Text( 25, "\196\224. \207\238\230\224\235\243\233\241\242\224 \231\224\239\232\248\232", MultiTrigger, GetMultiTrigger(), 12 )
	--Text( 25, "Нет, спасибо",CloseTalk )
	Text( 25, "\205\229\242, \241\239\224\241\232\225\238",CloseTalk )

	--Talk( 26, "Извини! У тебя не хватает золота для телепортации." )
	Talk( 26, "\200\231\226\232\237\232! \211 \242\229\225\255 \237\229 \245\226\224\242\224\229\242 \231\238\235\238\242\224 \228\235\255 \242\229\235\229\239\238\240\242\224\246\232\232." )

	--Talk( 27, "Запомни где меня искать, когда тебе понадобяться услуги телепортации, приходи я помогу!", CloseTalk )
	Talk( 27, "\199\224\239\238\236\237\232 \227\228\229 \236\229\237\255 \232\241\234\224\242\252, \234\238\227\228\224 \242\229\225\229 \239\238\237\224\228\238\225\255\242\252\241\255 \243\241\235\243\227\232 \242\229\235\229\239\238\240\242\224\246\232\232, \239\240\232\245\238\228\232 \255 \239\238\236\238\227\243!", CloseTalk )

	
	InitTrigger()
	TriggerCondition( 1, IsMapNpc, "garner", 96 )
	TriggerAction( 1, JumpPage, 1 )
	TriggerCondition( 2, IsMapNpc, "garner", 94 )
	TriggerAction( 2, JumpPage, 2 )
	TriggerCondition( 3, IsMapNpc, "garner", 95 )
	TriggerAction( 3, JumpPage, 4 )
	TriggerCondition( 4, IsMapNpc, "garner", 97 )
	TriggerAction( 4, JumpPage, 5 )
	TriggerCondition( 5, IsMapNpc, "garner", 55 )
	TriggerAction( 5, JumpPage, 6 )
	TriggerCondition( 6, IsMapNpc, "garner", 56 )
	TriggerAction( 6, JumpPage, 3 )
	TriggerCondition( 7, IsMapNpc, "magicsea", 50 )
	TriggerAction( 7, JumpPage, 7 )
	TriggerCondition( 8, IsMapNpc, "magicsea", 46 )
	TriggerAction( 8, JumpPage, 8 )
	TriggerCondition( 9, IsMapNpc, "darkblue", 56 )
	TriggerAction( 9, JumpPage, 9 )
	TriggerCondition( 10, IsMapNpc, "darkblue", 42 )
	TriggerAction( 10, JumpPage, 10 )
	TriggerCondition( 11, IsMapNpc, "darkblue", 46 )
	TriggerAction( 11, JumpPage, 11 )
	TriggerCondition( 12, IsMapNpc, "darkblue", 51 )
	TriggerAction( 12, JumpPage, 12 )
	Start( GetMultiTrigger(), 12 )

end

-- Островные Портальщики

function island()

	--local ReSelectTalk = "Мне нужно подумать."
	local ReSelectTalk = "\204\237\229 \237\243\230\237\238 \239\238\228\243\236\224\242\252."
	local ReSelectPage = 1

	
	--local CancelSelectTalk = "Забудь! Я останусь тут."
	local CancelSelectTalk = "\199\224\225\243\228\252! \223 \238\241\242\224\237\243\241\252 \242\243\242."
	local CancelSelectPage = 27

	-- (Список локаций используемый портальщиком)
	local CurMapName1 = "garner"     -- Аскарон
	local CurMapName2 = "magicsea"   -- Магический Океан
	local CurMapName3 = "eastgoaf"   -- Серебрянные Шахты,Логово Черного Дракона...
	local CurMapName4 = "lonetower"  -- Одинокая Башня
	local CurMapName5 = "darkblue"   -- Великий Синий Океан

	-- Аскарон
	local GoTo01X = 3260             -- Координата (X)
	local GoTo01Y = 3280             -- Координата (Y)
	local GoTo01M = CurMapName1

	-- Аскарон
	local GoTo02X = 2273
	local GoTo02Y = 1122
	local GoTo02M = CurMapName1

	-- Аскарон
	local GoTo03X = 3590
	local GoTo03Y = 755
	local GoTo03M = CurMapName1

	-- Магический Океан
	local GoTo04X = 2376
	local GoTo04Y = 725
	local GoTo04M = CurMapName2

	-- Магический Океан
	local GoTo05X = 1730
	local GoTo05Y = 3775
	local GoTo05M = CurMapName2

	-- Магический Океан
	local GoTo06X = 2529
	local GoTo06Y = 2406
	local GoTo06M = CurMapName2

	-- Великий Синий Океан
	local GoTo07X = 1631
	local GoTo07Y = 1974
	local GoTo07M = CurMapName5

	-- Аскарон
	local GoTo08X = 2231
	local GoTo08Y = 2788
	local GoTo08M = CurMapName1

	--Talk( 1, "Сильвиус: Привет! Я островной портальщик Сильвиус. Чем я могу помочь тебе?" )
	Talk( 1, "\209\232\235\252\226\232\243\241: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \209\232\235\252\226\232\243\241. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 1, "На остров Зефира", JumpPage, 14 )
	Text( 1, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 1, "На Ледниковый остров", JumpPage, 15 )
	Text( 1, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 1, "На остров Отверженных", JumpPage, 16 )
	Text( 1, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 1, "На остров Стужи", JumpPage, 17 )
	Text( 1, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 1, "На остров Канареек", JumpPage, 18 )
	Text( 1, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 1, "На остров Купидона", JumpPage, 19 )
	Text( 1, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 1, "На остров Удачи", JumpPage, 20 )
	Text( 1, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 1, "Записать точку возрождения", JumpPage, 25 )	
	Text( 1, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		
	
	--Talk( 2, "Андрэа: Привет! Я островной портальщик Андрэа. Чем я могу помочь тебе?" )
	Talk( 2, "\192\237\228\240\253\224: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \192\237\228\240\253\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 2, "Отправиться в Аргент", JumpPage, 21 )
	Text( 2, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 2, "На Ледниковый остров", JumpPage, 15 )
	Text( 2, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 2, "На остров Отверженных", JumpPage, 16 )
	Text( 2, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 2, "На остров Стужи", JumpPage, 17 )
	Text( 2, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 2, "На остров Канареек", JumpPage, 18 )
	Text( 2, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 2, "На остров Купидона", JumpPage, 19 )
	Text( 2, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 2, "На остров Удачи", JumpPage, 20 )
	Text( 2, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 2, "Записать точку возрождения", JumpPage, 25 )	
	Text( 2, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )		

	--Talk( 3, "Арсен: Привет! Я островной портальщик Арсен. Чем я могу помочь тебе?" )
	Talk( 3, "\192\240\241\229\237: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \192\240\241\229\237. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 3, "Отправиться в Аргент", JumpPage, 21 )
	Text( 3, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 3, "На остров Зефира", JumpPage, 14 )
	Text( 3, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 3, "На остров Отверженных", JumpPage, 16 )
	Text( 3, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 3, "На остров Стужи", JumpPage, 17 )
	Text( 3, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 3, "На остров Канареек", JumpPage, 18 )
	Text( 3, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 3, "На остров Купидона", JumpPage, 19 )
	Text( 3, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 3, "На остров Удачи", JumpPage, 20 )
	Text( 3, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 3, "Записать точку возрождения", JumpPage, 25 )	
	Text( 3, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )	

	--Talk( 4, "Шейла: Привет! Я островной портальщик Шейла. Чем я могу помочь тебе?" )
	Talk( 4, "\216\229\233\235\224: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \216\229\233\235\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 4, "Отправиться в Аргент", JumpPage, 21 )
	Text( 4, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 4, "На остров Зефира", JumpPage, 14 )
	Text( 4, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 4, "На Ледниковый остров", JumpPage, 15 )
	Text( 4, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 4, "На остров Стужи", JumpPage, 17 )
	Text( 4, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 4, "На остров Канареек", JumpPage, 18 )
	Text( 4, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 4, "На остров Купидона", JumpPage, 19 )
	Text( 4, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 4, "На остров Удачи", JumpPage, 20 )
	Text( 4, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 4, "Записать точку возрождения", JumpPage, 25 )    
	Text( 4, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )        

	--Talk( 5, "Джули: Привет! Я островной портальщик Джули. Чем я могу помочь тебе?" )
	Talk( 5, "\196\230\243\235\232: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \196\230\243\235\232. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 5, "Отправиться в Аргент", JumpPage, 21 )
	Text( 5, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 5, "На остров Зефира", JumpPage, 14 )
	Text( 5, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 5, "На Ледниковый остров", JumpPage, 15 )
	Text( 5, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 5, "На остров Отверженных", JumpPage, 16 )
	Text( 5, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 5, "На остров Канареек", JumpPage, 18 )
	Text( 5, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 5, "На остров Купидона", JumpPage, 19 )
	Text( 5, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 5, "На остров Удачи", JumpPage, 20 )
	Text( 5, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 5, "Записать точку возрождения", JumpPage, 25 )          
	Text( 5, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )          


	--Talk( 6, "Винни: Привет! Я островной портальщик Винни. Чем я могу помочь тебе?" )
	Talk( 6, "\194\232\237\237\232: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \194\232\237\237\232. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 6, "Отправиться в Аргент", JumpPage, 21 )
	Text( 6, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 6, "На остров Зефира", JumpPage, 14 )
	Text( 6, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 6, "На Ледниковый остров", JumpPage, 15 )
	Text( 6, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 6, "На остров Отверженных", JumpPage, 16 )
	Text( 6, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 6, "На остров Стужи", JumpPage, 17 )
	Text( 6, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 6, "На остров Купидона", JumpPage, 19 )
	Text( 6, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 6, "На остров Удачи", JumpPage, 20 )
	Text( 6, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 6, "Записать точку возрождения", JumpPage, 25 )      
	Text( 6, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )       

	--Talk( 7, "Ванда: Привет! Я островной портальщик Ванда. Чем я могу помочь тебе?" )
	Talk( 7, "\194\224\237\228\224: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \194\224\237\228\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 7, "Отправиться в Аргент", JumpPage, 21 )
	Text( 7, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 7, "На остров Зефира", JumpPage, 14 )
	Text( 7, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 7, "На Ледниковый остров", JumpPage, 15 )
	Text( 7, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 7, "На остров Отверженных", JumpPage, 16 )
	Text( 7, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 7, "На остров Стужи", JumpPage, 17 )
	Text( 7, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 7, "На остров Канареек", JumpPage, 18 )
	Text( 7, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 7, "На остров Удачи", JumpPage, 20 )
	Text( 7, "\205\224 \238\241\242\240\238\226 \211\228\224\247\232", JumpPage, 20 )
	--Text( 7, "Записать точку возрождения", JumpPage, 25 )    
	Text( 7, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )         

	--Talk( 8, "Джульета: Привет! Я островной портальщик Джульета. Чем я могу помочь тебе?" )
	Talk( 8, "\196\230\243\235\252\229\242\224: \207\240\232\226\229\242! \223 \238\241\242\240\238\226\237\238\233 \239\238\240\242\224\235\252\249\232\234 \196\230\243\235\252\229\242\224. \215\229\236 \255 \236\238\227\243 \239\238\236\238\247\252 \242\229\225\229?" )
	--Text( 8, "Отправиться в Аргент", JumpPage, 21 )
	Text( 8, "\206\242\239\240\224\226\232\242\252\241\255 \226 \192\240\227\229\237\242", JumpPage, 21 )
	--Text( 8, "На остров Зефира", JumpPage, 14 )
	Text( 8, "\205\224 \238\241\242\240\238\226 \199\229\244\232\240\224", JumpPage, 14 )
	--Text( 8, "На Ледниковый остров", JumpPage, 15 )
	Text( 8, "\205\224 \203\229\228\237\232\234\238\226\251\233 \238\241\242\240\238\226", JumpPage, 15 )
	--Text( 8, "На остров Отверженных", JumpPage, 16 )
	Text( 8, "\205\224 \238\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", JumpPage, 16 )
	--Text( 8, "На остров Стужи", JumpPage, 17 )
	Text( 8, "\205\224 \238\241\242\240\238\226 \209\242\243\230\232", JumpPage, 17 )
	--Text( 8, "На остров Канареек", JumpPage, 18 )
	Text( 8, "\205\224 \238\241\242\240\238\226 \202\224\237\224\240\229\229\234", JumpPage, 18 )
	--Text( 8, "На остров Купидона", JumpPage, 19 )
	Text( 8, "\205\224 \238\241\242\240\238\226 \202\243\239\232\228\238\237\224", JumpPage, 19 )
	--Text( 8, "Записать точку возрождения", JumpPage, 25 )    
	Text( 8, "\199\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\238\230\228\229\237\232\255", JumpPage, 25 )       

	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo01X, GoTo01Y, GoTo01M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 14, "Отправить на Остров Зефира? Нет проблем! Заплати (2000) золотых!" )
	Talk( 14, "\206\242\239\240\224\226\232\242\252 \237\224 \206\241\242\240\238\226 \199\229\244\232\240\224? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 14, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 14, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 14, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo02X, GoTo02Y, GoTo02M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 15, "Отправить на Ледниковый Остров? Нет проблем! Заплати (2000) золотых!" )
	Talk( 15, "\206\242\239\240\224\226\232\242\252 \237\224 \203\229\228\237\232\234\238\226\251\233 \206\241\242\240\238\226? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 15, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 15, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 15, CancelSelectTalk, JumpPage , CancelSelectPage )
	
	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo03X, GoTo03Y, GoTo03M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 16, "Отправить на Остров Отверженных? Нет проблем! Заплати (2000) золотых!" )
	Talk( 16, "\206\242\239\240\224\226\232\242\252 \237\224 \206\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 16, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 16, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 16, CancelSelectTalk, JumpPage , CancelSelectPage )
	
	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo04X, GoTo04Y, GoTo04M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 17, "Отправить на Остров Стужи? Нет проблем! Заплати (2000) золотых!" )
	Talk( 17, "\206\242\239\240\224\226\232\242\252 \237\224 \206\241\242\240\238\226 \209\242\243\230\232? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 17, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 17, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 17, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo05X, GoTo05Y, GoTo05M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 18, "Отправить на Остров Канареек? Нет проблем! Заплати (2000) золотых!" )
	Talk( 18, "\206\242\239\240\224\226\232\242\252 \237\224 \206\241\242\240\238\226 \202\224\237\224\240\229\229\234? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 18, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 18, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 18, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo06X, GoTo06Y, GoTo06M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 19, "Отправить на Остров Купидона? Нет проблем! Заплати (2000) золотых!" )
	Talk( 19, "\206\242\239\240\224\226\232\242\252 \237\224 \206\241\242\240\238\226 \202\243\239\232\228\238\237\224? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 19, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 19, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 19, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo07X, GoTo07Y, GoTo07M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 20, "Отправить на Остров Удачи? Нет проблем! Заплати (2000) золотых!" )
	Talk( 20, "\206\242\239\240\224\226\232\242\252 \237\224 \206\241\242\240\238\226 \211\228\224\247\232? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 20, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 20, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 20, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, HasMoney, 2000 )
	TriggerAction( 1, TakeMoney, 2000 )
	TriggerAction( 1, GoTo, GoTo08X, GoTo08Y, GoTo08M )
	TriggerFailure( 1, JumpPage, 26 )
	--Talk( 21, "Отправить в Аргент? Нет проблем! Заплати (2000) золотых!" )
	Talk( 21, "\206\242\239\240\224\226\232\242\252 \226 \192\240\227\229\237\242? \205\229\242 \239\240\238\225\235\229\236! \199\224\239\235\224\242\232 (2000) \231\238\235\238\242\251\245!" )
	--Text( 21, "Отправиться",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 21, "\206\242\239\240\224\226\232\242\252\241\255",MultiTrigger, GetMultiTrigger(), 1 ) 
	Text( 21, CancelSelectTalk, JumpPage , CancelSelectPage )

	InitTrigger()
	TriggerCondition( 1, IsMapNpc, "garner", 123 )
	TriggerAction( 1, SetSpawnPos, "\192\240\227\229\237\242")
	--TriggerAction( 1, SetSpawnPos, "\192\240\227\229\237\242") -- Аргент
	TriggerCondition( 2, IsMapNpc, "garner", 124 )
	TriggerAction( 2, SetSpawnPos, "\206\241\242\240\238\226 \199\229\244\232\240\224")
	--TriggerAction( 2, SetSpawnPos, "\206\241\242\240\238\226 \199\229\244\232\240\224") -- Остров Зефира
	TriggerCondition( 3, IsMapNpc, "garner", 125 )
	TriggerAction( 3, SetSpawnPos, "\203\229\228\255\237\238\233 \238\241\242\240\238\226")
	--TriggerAction( 3, SetSpawnPos, "\203\229\228\237\232\234\238\226\251\233 \206\241\242\240\238\226") -- Ледниковый Остров
	TriggerCondition( 4, IsMapNpc, "garner", 126 )
	TriggerAction( 4, SetSpawnPos, "\206\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245")
	--TriggerAction( 4, SetSpawnPos, "\206\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245") -- Остров Отверженных
	TriggerCondition( 5, IsMapNpc, "magicsea", 69 )
	TriggerAction( 5, SetSpawnPos, "\206\241\242\240\238\226 \209\242\243\230\232")
	--TriggerAction( 5, SetSpawnPos, "Isle of Chill(\206\241\242\240\238\226 \209\242\243\230\232") -- Остров Стужи
	TriggerCondition( 6, IsMapNpc, "magicsea", 70)
	TriggerAction( 6, SetSpawnPos, "\206\241\242\240\238\226 \202\224\237\224\240\229\229\234")
	--TriggerAction( 6, SetSpawnPos, "\206\241\242\240\238\226 \202\224\237\224\240\229\229\234") -- Остров Канареек
	TriggerCondition( 7, IsMapNpc, "magicsea", 71 )
	TriggerAction( 7, SetSpawnPos, "\206\241\242\240\238\226 \202\243\239\232\228\238\237\224")
	--TriggerAction( 7, SetSpawnPos, "\206\241\242\240\238\226 \202\243\239\232\228\238\237\224") -- Остров Купидона
	TriggerCondition( 8, IsMapNpc, "darkblue", 65 )
	TriggerAction( 8, SetSpawnPos, "\206\241\242\240\238\226 \211\228\224\247\232")
	--TriggerAction( 8, SetSpawnPos, "\206\241\242\240\238\226 \211\228\224\247\232") -- Остров Удачи
	TriggerFailure( 8, JumpPage, 28 )
	--Talk( 25, "Хочешь записать точку возраждения здесь?" )
	Talk( 25, "\213\238\247\229\248\252 \231\224\239\232\241\224\242\252 \242\238\247\234\243 \226\238\231\240\224\230\228\229\237\232\255 \231\228\229\241\252?" )
	--Text( 25, "Да. Пожалуйста запиши", MultiTrigger, GetMultiTrigger(), 8 )
	Text( 25, "\196\224. \207\238\230\224\235\243\233\241\242\224 \231\224\239\232\248\232", MultiTrigger, GetMultiTrigger(), 8 )
	--Text( 25, "Нет, спасибо",CloseTalk )
	Text( 25, "\205\229\242, \241\239\224\241\232\225\238",CloseTalk )

	--Talk( 26, "Извини! У тебя не хватает золота для телепортации." )
	Talk( 26, "\200\231\226\232\237\232! \211 \242\229\225\255 \237\229 \245\226\224\242\224\229\242 \231\238\235\238\242\224 \228\235\255 \242\229\235\229\239\238\240\242\224\246\232\232." )

	--Talk( 27, "Запомни где меня искать, когда тебе понадобяться услуги телепортации, приходи я помогу!", CloseTalk )
	Talk( 27, "\199\224\239\238\236\237\232 \227\228\229 \236\229\237\255 \232\241\234\224\242\252, \234\238\227\228\224 \242\229\225\229 \239\238\237\224\228\238\225\255\242\252\241\255 \243\241\235\243\227\232 \242\229\235\229\239\238\240\242\224\246\232\232, \239\240\232\245\238\228\232 \255 \239\238\236\238\227\243!", CloseTalk )


	InitTrigger()
	TriggerCondition( 1, IsMapNpc, "garner", 123 )
	TriggerAction( 1, JumpPage, 1 )
	TriggerCondition( 2, IsMapNpc, "garner", 124 )
	TriggerAction( 2, JumpPage, 2 )
	TriggerCondition( 3, IsMapNpc, "garner", 125 )
	TriggerAction( 3, JumpPage, 3 )
	TriggerCondition( 4, IsMapNpc, "garner", 126 )
	TriggerAction( 4, JumpPage, 4 )
	TriggerCondition( 5, IsMapNpc, "magicsea", 69 )
	TriggerAction( 5, JumpPage, 5)
	TriggerCondition( 6, IsMapNpc, "magicsea", 70)
	TriggerAction( 6, JumpPage, 6 )
	TriggerCondition( 7, IsMapNpc, "magicsea", 71 )
	TriggerAction( 7, JumpPage, 7)
	TriggerCondition( 8, IsMapNpc, "darkblue", 65 )
	TriggerAction( 8, JumpPage, 8 )
	Start( GetMultiTrigger(), 8 )
end