print("‡ Јаг§Є  JobType.lua")

------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------Введённые в игру---------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------------------------
JOB_TYPE_XINSHOU		= 0;	-- "Новичок"
JOB_TYPE_JIANSHI		= 1;	-- "Мечник"
JOB_TYPE_LIEREN			= 2;	-- "Охотник"
JOB_TYPE_MAOXIANZHE		= 4;	-- "Исследователь"
JOB_TYPE_JUJS			= 8;	-- "Чемпион"
JOB_TYPE_SHUANGJS		= 9;	-- "Воитель"
JOB_TYPE_JUJISHOU		= 12;	-- "Стрелок"
JOB_TYPE_SHENGZHIZHE		= 13;	-- "Целительница"
JOB_TYPE_FENGYINSHI		= 14;	-- "Колдунья"
JOB_TYPE_HANGHAISHI		= 16;	-- "Покоритель Морей"

------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------Не введённые в игру---------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------------------------
JOB_TYPE_SHUISHOU		= 3;	-- "Матрос"
JOB_TYPE_QIYUANSHI		= 5;	-- "Ангел Хранитель"
JOB_TYPE_JISHI			= 6;	-- "Ремесленник"
JOB_TYPE_SHANGREN		= 7;	-- "Купец"
JOB_TYPE_JIANDUNSHI		= 10;	-- "Белый Рыцарь"
JOB_TYPE_XUNSHOUSHI		= 11;	-- "Укротитель Животных"
JOB_TYPE_CHUANZHANG		= 15;	-- "Капитан"
JOB_TYPE_BAOFAHU		= 17;	-- "Выскочка"
JOB_TYPE_GONGCHENGSHI	= 18;	-- "Инженер"