--------------------------------------------------------------------------
--									--
--									--
--			Greh1monster_conf.lua			--
--									--
--									--
--------------------------------------------------------------------------
print( "Loading Greh1Monster_Conf.lua" )
print( "------------------------------------" )

CreateCha(1161, 3300, 3300, 145, 3600) --босс для Чемпиона
CreateCha(1162, 8500, 3300, 145, 3600) --босс для Воителя
CreateCha(1163, 13900, 3300, 145, 3600) --босс для Стрелка
CreateCha(1164, 3300, 18000, 145, 3600) --босс для Цилителя
CreateCha(1165, 8500, 18000, 145, 3600) --босс для Колдуньи
CreateCha(1166, 18000, 18000, 145, 3600) --босс для Покорителя морей