--birth_conf.lua
print( "‡ Јаг§Є  Birth_conf.lua" ) --вывод в консоль ГСа

ClearAllBirthPoint()
--Аргент
AddBirthPoint("\192\240\227\229\237\242", "garner",  2232, 2787)
AddBirthPoint("\192\240\227\229\237\242", "garner",  2194, 2779)
AddBirthPoint("\192\240\227\229\237\242", "garner",  2245, 2703)
--AddBirthPoint("Аргент", "garner",  2232, 2787)
--AddBirthPoint("Аргент", "garner",  2194, 2779)
--AddBirthPoint("Аргент", "garner",  2245, 2703)


--Громоград
AddBirthPoint("\195\240\238\236\238\227\240\224\228", "garner",  736,  1592)
AddBirthPoint("\195\240\238\236\238\227\240\224\228", "garner",  768,  1539)
AddBirthPoint("\195\240\238\236\238\227\240\224\228", "garner",  738,  1454)
--AddBirthPoint("Громоград", "garner",  736,  1592)
--AddBirthPoint("Громоград", "garner",  768,  1539)
--AddBirthPoint("Громоград", "garner",  738,  1454)


--Шайтан
AddBirthPoint("\216\224\233\242\224\237", "magicsea",  891,  3575)
AddBirthPoint("\216\224\233\242\224\237", "magicsea",  819,  3654)
AddBirthPoint("\216\224\233\242\224\237", "magicsea",  845,  3502)
--AddBirthPoint("Шайтан", "magicsea",  891,  3575)
--AddBirthPoint("Шайтан", "magicsea",  819,  3654)
--AddBirthPoint("Шайтан", "magicsea",  845,  3502)


--Ледынь
AddBirthPoint("\203\229\228\251\237\252", "darkblue",  1316,  536)
AddBirthPoint("\203\229\228\251\237\252", "darkblue",  1342,  481)
AddBirthPoint("\203\229\228\251\237\252", "darkblue",  1305,  503)
--AddBirthPoint("Ледынь", "darkblue",  1316,  536)
--AddBirthPoint("Ледынь", "darkblue",  1342,  481)
--AddBirthPoint("Ледынь", "darkblue",  1305,  503)


--Остров Арены
AddBirthPoint("\206\241\242\240\238\226 \192\240\229\237\251", "darkblue",  471,  3407)
AddBirthPoint("\206\241\242\240\238\226 \192\240\229\237\251", "darkblue",  401,  3464)
AddBirthPoint("\206\241\242\240\238\226 \192\240\229\237\251", "darkblue",  463,  3461)
AddBirthPoint("\206\241\242\240\238\226 \192\240\229\237\251", "darkblue",  457,  3434)
AddBirthPoint("\206\241\242\240\238\226 \192\240\229\237\251", "darkblue",  426,  3435)
--AddBirthPoint("Остров Арены", "darkblue",  471,  3407)
--AddBirthPoint("Остров Арены", "darkblue",  401,  3464)
--AddBirthPoint("Остров Арены", "darkblue",  463,  3461)
--AddBirthPoint("Остров Арены", "darkblue",  457,  3434)
--AddBirthPoint("Остров Арены", "darkblue",  426,  3435)


--Халдейская гавань
AddBirthPoint("\213\224\235\228\229\233\241\234\224\255 \227\224\226\224\237\252", "garner",  633,  2100)
--AddBirthPoint("Халдейская гавань", "garner",  633,  2100)



--Андийский лес
AddBirthPoint("\192\237\228\232\233\241\234\232\233 \235\229\241", "garner",  1007,  2966)
--AddBirthPoint("Андийский лес", "garner",  1007,  2966)


--Заброшенные шахты
AddBirthPoint("\199\224\225\240\238\248\229\237\237\251\229 \248\224\245\242\251", "garner",  1903,2807)
--AddBirthPoint("Заброшенные шахты", "garner",  1903,2807)


--Скалистый удел
AddBirthPoint("\209\234\224\235\232\241\242\251\233 \243\228\229\235", "garner",  1517,3091)
--AddBirthPoint("Скалистый удел", "garner",  1517,3091)


--Валгалла
AddBirthPoint("\194\224\235\227\224\235\235\224", "garner",  1120,2773)
--AddBirthPoint("Валгалла", "garner",  1120,2773)


--Обитель Радости
AddBirthPoint("\206\225\232\242\229\235\252 \208\224\228\238\241\242\232", "garner",  535,2433)
--AddBirthPoint("Обитель Радости", "garner",  535,2433)


--Гавань Оазиса
AddBirthPoint("\195\224\226\224\237\252 \206\224\231\232\241\224", "magicsea",  787,3121)
--AddBirthPoint("Гавань Оазиса", "magicsea",  787,3121)


--Поселение в пустыни
AddBirthPoint("\207\238\241\229\235\229\237\232\229 \226 \239\243\241\242\251\237\232", "magicsea",  1214,3203)
--AddBirthPoint("Поселение в пустыни", "magicsea",  1214,3203)


--Ледяная гавань
AddBirthPoint("\203\229\228\255\237\224\255 \227\224\226\224\237\252", "darkblue",  807,360)
--AddBirthPoint("Ледяная гавань", "darkblue",  807,360)


--Бухта Атлантис
AddBirthPoint("\193\243\245\242\224 \192\242\235\224\237\242\232\241", "darkblue",  1050,656)
--AddBirthPoint("Бухта Атлантис", "darkblue",  1050,656)


--Берег Скелетов
AddBirthPoint("\193\229\240\229\227 \209\234\229\235\229\242\238\226", "darkblue",  2146,542)
--AddBirthPoint("Берег Скелетов", "darkblue",  2146,542)


--Ледяной шип
AddBirthPoint("\203\229\228\255\237\238\233 \248\232\239", "darkblue",  2681,647)
--AddBirthPoint("Ледяной шип", "darkblue",  2681,647)


--Остров Зефира
AddBirthPoint("\206\241\242\240\238\226 \199\229\244\232\240\224", "garner",  3260,3280)
--AddBirthPoint("Остров Зефира", "garner",  3260,3280)


--Ледяной остров
AddBirthPoint("\203\229\228\255\237\238\233 \238\241\242\240\238\226", "garner",  2273,1122)
--AddBirthPoint("Ледяной остров", "garner",  2273,1122)


--Остров Отверженных
AddBirthPoint("\206\241\242\240\238\226 \206\242\226\229\240\230\229\237\237\251\245", "garner",  3590,755)
--AddBirthPoint("Остров Отверженных", "garner",  3590,755)


--Остров Стужи
AddBirthPoint("\206\241\242\240\238\226 \209\242\243\230\232", "magicsea",  2376,725)
--AddBirthPoint("Остров Стужи", "magicsea",  2376,725)


--Остров Канареек
AddBirthPoint("\206\241\242\240\238\226 \202\224\237\224\240\229\229\234", "magicsea",  1730,3775)
--AddBirthPoint("Остров Канареек", "magicsea",  1730,3775)


--Остров Купидона
AddBirthPoint("\206\241\242\240\238\226 \202\243\239\232\228\238\237\224", "magicsea",  2527,2399)
--AddBirthPoint("Остров Купидона", "magicsea",  2527,2399)


--Остров Удачи
AddBirthPoint("\206\241\242\240\238\226 \211\228\224\247\232", "darkblue",  1631,1974)
--AddBirthPoint("Остров Удачи", "darkblue",  1631,1974)


--Синяя сторона
AddBirthPoint("\209\232\237\255\255 \241\242\238\240\238\237\224", "secretgarden",  54, 50)
--AddBirthPoint("Синяя сторона", "secretgarden",  54, 50)


--Красная сторона
AddBirthPoint("\202\240\224\241\237\224\255 \241\242\238\240\238\237\224", "secretgarden",  430, 437)
--AddBirthPoint("Красная сторона", "secretgarden",  430, 437)


--Темная топь
AddBirthPoint("\210\229\236\237\224\255 \242\238\239\252", "darkswamp",  55, 65)
--AddBirthPoint("Темная топь", "darkswamp",  55, 65)


--Затерянный город 1
AddBirthPoint("\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 1", "abandonedcity",  37, 43)
--AddBirthPoint("Затерянный город 1", "abandonedcity",  37, 43)


--Затерянный город 2
AddBirthPoint("\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 2", "abandonedcity2",  25, 24)
AddBirthPoint("\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 2", "abandonedcity2",  26, 469)
AddBirthPoint("\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 2", "abandonedcity2",  456, 466)
AddBirthPoint("\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 2", "abandonedcity2",  462, 25)
--AddBirthPoint("Затерянный город 2", "abandonedcity2",  25, 24)
--AddBirthPoint("Затерянный город 2", "abandonedcity2",  26, 469)
--AddBirthPoint("Затерянный город 2", "abandonedcity2",  456, 466)
--AddBirthPoint("Затерянный город 2", "abandonedcity2",  462, 25)


--Затерянный город 3
AddBirthPoint("\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 3", "abandonedcity3",  244, 224)
--AddBirthPoint("Затерянный город 3", "abandonedcity3",  244, 224)


--Мир демонов 1
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 1", "puzzleworld",  36, 20)
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 1", "puzzleworld",  522, 32)
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 1", "puzzleworld",  36, 527)
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 1", "puzzleworld",  510, 527)
--AddBirthPoint("Мир демонов 1", "puzzleworld",  36, 20)
--AddBirthPoint("Мир демонов 1", "puzzleworld",  522, 32)
--AddBirthPoint("Мир демонов 1", "puzzleworld",  36, 527)
--AddBirthPoint("Мир демонов 1", "puzzleworld",  510, 527)



--Мир демонов 2
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 2", "puzzleworld2",  26, 23)
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 2", "puzzleworld2",  26, 521)
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 2", "puzzleworld2",  513, 518)
AddBirthPoint("\204\232\240 \228\229\236\238\237\238\226 2", "puzzleworld2",  518, 28)
--AddBirthPoint("Мир демонов 2", "puzzleworld2",  26, 23)
--AddBirthPoint("Мир демонов 2", "puzzleworld2",  26, 521)
--AddBirthPoint("Мир демонов 2", "puzzleworld2",  513, 518)
--AddBirthPoint("Мир демонов 2", "puzzleworld2",  518, 28)



--Гавань Громограда
AddBirthPoint("\195\224\226\224\237\252 \195\240\238\236\238\227\240\224\228\224", "garner", 743,1586 )
--AddBirthPoint("Гавань Громограда", "garner", 743,1586 )


--Военный порт Громограда
AddBirthPoint("\194\238\229\237\237\251\233 \239\238\240\242 \195\240\238\236\238\227\240\224\228\224", "garner", 990,1263 )
--AddBirthPoint("Военный порт Громограда", "garner", 990,1263 )



--Священная снежная гора
AddBirthPoint("\209\226\255\249\229\237\237\224\255 \241\237\229\230\237\224\255 \227\238\240\224", "garner", 914,1072 )
--AddBirthPoint("Священная снежная гора", "garner", 914,1072 )



--Андийский лес
AddBirthPoint("\192\237\228\232\233\241\234\232\233 \235\229\241", "garner", 1018,2975 )
--AddBirthPoint("Андийский лес", "garner", 1018,2975 )


--Гавань Оазиса
AddBirthPoint("\195\224\226\224\237\252 \206\224\231\232\241\224", "magicsea", 804,3115 )
--AddBirthPoint("Гавань Оазиса", "magicsea", 804,3115 )



--Ледяной шип
AddBirthPoint("\203\229\228\255\237\238\233 \248\232\239", "darkblue", 2697,638 )
--AddBirthPoint("Ледяной шип", "darkblue", 2697,638 )


--Одинокая башня (снаружи)
AddBirthPoint("\206\228\232\237\238\234\224\255 \225\224\248\237\255 (\241\237\224\240\243\230\232)", "garner", 271,1775 )
--AddBirthPoint("Одинокая башня (снаружи)", "garner", 271,1775 )


--Пещера терранцев
AddBirthPoint("\207\229\249\229\240\224 \242\229\240\240\224\237\246\229\226", "magicsea", 1369,3033 )
--AddBirthPoint("Пещера терранцев", "magicsea", 1369,3033 )


--Заброшенные шахты 2
AddBirthPoint("\199\224\225\240\238\248\229\237\237\251\229 \248\224\245\242\251 2", "eastgoaf", 116,28 )
--AddBirthPoint("Заброшенные шахты 2", "eastgoaf", 116,28 )


--Серебрянные шахты 2
AddBirthPoint("\209\229\240\229\225\240\255\237\237\251\229 \248\224\245\242\251 2", "eastgoaf", 238,27 )
--AddBirthPoint("Серебрянные шахты 2", "eastgoaf", 238,27 )


--Серебрянные шахты 3
AddBirthPoint("\209\229\240\229\225\240\255\237\237\251\229 \248\224\245\242\251 3", "eastgoaf", 382,123 )
--AddBirthPoint("Серебрянные шахты 3", "eastgoaf", 382,123 )


--Заброшенные шахты 1
AddBirthPoint("\199\224\225\240\238\248\229\237\237\251\229 \248\224\245\242\251 1", "garner", 1642,2698 )
--AddBirthPoint("Заброшенные шахты 1", "garner", 1642,2698 )


--Одинокая башня по уровням
AddBirthPoint("\206\228\232\237\238\234\224\255 \225\224\248\237\255 2", "lonetower", 35,21	)
AddBirthPoint("\206\228\232\237\238\234\224\255 \225\224\248\237\255 3", "lonetower", 120,406	)
AddBirthPoint("\206\228\232\237\238\234\224\255 \225\224\248\237\255 4", "lonetower", 320,175	)
AddBirthPoint("\206\228\232\237\238\234\224\255 \225\224\248\237\255 5", "lonetower", 483,121	)
AddBirthPoint("\206\228\232\237\238\234\224\255 \225\224\248\237\255 6", "lonetower", 494,297	)
--AddBirthPoint("Одинокая башня 2", "lonetower", 35,21	)
--AddBirthPoint("Одинокая башня 3", "lonetower", 120,406	)
--AddBirthPoint("Одинокая башня 4", "lonetower", 320,175	)
--AddBirthPoint("Одинокая башня 5", "lonetower", 483,121	)
--AddBirthPoint("Одинокая башня 6", "lonetower", 494,297	)


--4 точки на арене
AddBirthPoint("\192\240\229\237\224 1", "teampk", 44,21	)
AddBirthPoint("\192\240\229\237\224 2", "teampk", 44,66	)
AddBirthPoint("\192\240\229\237\224 3", "teampk", 20,44	)
AddBirthPoint("\192\240\229\237\224 4", "teampk", 66,44	)
--AddBirthPoint("Арена 1", "teampk", 44,21	)
--AddBirthPoint("Арена 2", "teampk", 44,66	)
--AddBirthPoint("Арена 3", "teampk", 20,44	)
--AddBirthPoint("Арена 4", "teampk", 66,44	)


--Бар Аргента
AddBirthPoint("\193\224\240 \192\240\227\229\237\242\224", "garner", 2207,2887	)
--AddBirthPoint("Бар Аргента", "garner", 2207,2887	)



--Весноград
AddBirthPoint("\194\229\241\237\238\227\240\224\228", "darkblue", 3323,2507	)
--AddBirthPoint("Весноград", "darkblue", 3323,2507	)


--Остров Лета
AddBirthPoint("\206\241\242\240\238\226 \203\229\242\224", "darkblue", 3681,2653	)
--AddBirthPoint("Остров Лета", "darkblue", 3681,2653	)


--Остров Осени
AddBirthPoint("\206\241\242\240\238\226 \206\241\229\237\232", "darkblue", 2635,3004	)
--AddBirthPoint("Остров Осени", "darkblue", 2635,3004	)


--Карибы
AddBirthPoint("\202\224\240\232\225\251", "jialebi", 620,951	)
--AddBirthPoint("Карибы", "jialebi", 620,951	)


--Абаддон 1-4
AddBirthPoint("\192\225\224\228\228\238\237 1-4", "jialebi", 153,905	)
--AddBirthPoint("Абаддон 1-4", "jialebi", 153,905	)


--Хаос Аргента
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 100,100	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 72,134	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 66,37	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 151,31	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 201,32	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 212,99	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 248,176	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 184,201	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 150,208	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 123,257	)
AddBirthPoint("\213\224\238\241 \192\240\227\229\237\242\224", "garner2", 136,133	)
--AddBirthPoint("Хаос Аргента", "garner2", 100,100	)
--AddBirthPoint("Хаос Аргента", "garner2", 72,134	)
--AddBirthPoint("Хаос Аргента", "garner2", 66,37	)
--AddBirthPoint("Хаос Аргента", "garner2", 151,31	)
--AddBirthPoint("Хаос Аргента", "garner2", 201,32	)
--AddBirthPoint("Хаос Аргента", "garner2", 212,99	)
--AddBirthPoint("Хаос Аргента", "garner2", 248,176	)
--AddBirthPoint("Хаос Аргента", "garner2", 184,201	)
--AddBirthPoint("Хаос Аргента", "garner2", 150,208	)
--AddBirthPoint("Хаос Аргента", "garner2", 123,257	)
--AddBirthPoint("Хаос Аргента", "garner2", 136,133	)


--Абаддон 5-8
AddBirthPoint("\192\225\224\228\228\238\237 5-8", "hell", 100,33	)
AddBirthPoint("\192\225\224\228\228\238\237 5-8", "hell", 36,33	)
AddBirthPoint("\192\225\224\228\228\238\237 5-8", "hell", 99,93	)
--AddBirthPoint("Абаддон 5-8", "hell", 100,33	)
--AddBirthPoint("Абаддон 5-8", "hell", 36,33	)
--AddBirthPoint("Абаддон 5-8", "hell", 99,93	)


--Абаддон 9
AddBirthPoint("\192\225\224\228\228\238\237 9", "hell2", 18,75	)
--AddBirthPoint("Абаддон 9", "hell2", 18,75	)


--Абаддон 10-17
AddBirthPoint("\192\225\224\228\228\238\237 10-17", "hell3", 191,209	)
--AddBirthPoint("Абаддон 10-17", "hell3", 191,209	)


--Абаддон 18
AddBirthPoint("\192\225\224\228\228\238\237 18", "hell4", 57,79	)
--AddBirthPoint("Абаддон 18", "hell4", 57,79	)


--Вечный Абаддон
AddBirthPoint("\194\229\247\237\251\233 \192\225\224\228\228\238\237", "hell5", 20,79	)
--AddBirthPoint("Вечный Абаддон", "hell5", 20,79	)


--Мираж Громограда
AddBirthPoint("\204\232\240\224\230 \195\240\238\236\238\227\240\224\228\224", "leiting2", 55,59	)
--AddBirthPoint("Мираж Громограда", "leiting2", 55,59	)


--Мираж Шайтана
AddBirthPoint("\204\232\240\224\230 \216\224\233\242\224\237\224", "shalan2", 231,184	)
--AddBirthPoint("Мираж Шайтана", "shalan2", 231,184	)


--Мираж Ледыни
AddBirthPoint("\204\232\240\224\230 \203\229\228\251\237\232", "binglang2", 67,71	)
--AddBirthPoint("Мираж Ледыни", "binglang2", 67,71	)


--СВ для флота
AddBirthPoint("\209\194 \228\235\255 \244\235\238\242\224", "guildwar", 207,116)
AddBirthPoint("\209\194 \228\235\255 \244\235\238\242\224", "guildwar", 301,93)
AddBirthPoint("\209\194 \228\235\255 \244\235\238\242\224", "guildwar", 424,92)
--AddBirthPoint("СВ для флота", "guildwar", 207,116)
--AddBirthPoint("СВ для флота", "guildwar", 301,93)
--AddBirthPoint("СВ для флота", "guildwar", 424,92)


--СВ для пиратов
AddBirthPoint("\209\194 \228\235\255 \239\232\240\224\242\238\226", "guildwar", 410,495)
AddBirthPoint("\209\194 \228\235\255 \239\232\240\224\242\238\226", "guildwar", 317,536)
AddBirthPoint("\209\194 \228\235\255 \239\232\240\224\242\238\226", "guildwar", 202,509)
--AddBirthPoint("СВ для пиратов", "guildwar", 410,495)
--AddBirthPoint("СВ для пиратов", "guildwar", 317,536)
--AddBirthPoint("СВ для пиратов", "guildwar", 202,509)


--Мини-СВ для флота
AddBirthPoint("\204\232\237\232-\209\194 \228\235\255 \244\235\238\242\224", "guildwar2", 207,116)
AddBirthPoint("\204\232\237\232-\209\194 \228\235\255 \244\235\238\242\224", "guildwar2", 301,93)
AddBirthPoint("\204\232\237\232-\209\194 \228\235\255 \244\235\238\242\224", "guildwar2", 424,92)
--AddBirthPoint("Мини-СВ для флота", "guildwar2", 207,116)
--AddBirthPoint("Мини-СВ для флота", "guildwar2", 301,93)
--AddBirthPoint("Мини-СВ для флота", "guildwar2", 424,92)


--Мини СВ для пиратов
AddBirthPoint("\204\232\237\232 \209\194 \228\235\255 \239\232\240\224\242\238\226", "guildwar2", 410,495)
AddBirthPoint("\204\232\237\232 \209\194 \228\235\255 \239\232\240\224\242\238\226", "guildwar2", 317,536)
AddBirthPoint("\204\232\237\232 \209\194 \228\235\255 \239\232\240\224\242\238\226", "guildwar2", 202,509)
--AddBirthPoint("Мини СВ для пиратов", "guildwar2", 410,495)
--AddBirthPoint("Мини СВ для пиратов", "guildwar2", 317,536)
--AddBirthPoint("Мини СВ для пиратов", "guildwar2", 202,509)




--Церковь
AddBirthPoint("\214\229\240\234\238\226\252", "yschurch", 200,160	)
--AddBirthPoint("Церковь", "yschurch", 200,160	)


-- Снежная война
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  144, 136)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  144, 243)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  251, 40)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  266, 88)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  27, 55)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  200, 50)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  220, 220)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  165, 253)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  33, 220)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  66, 201)
AddBirthPoint("\209\237\229\230\237\224\255 \226\238\233\237\224", "07xmas2",  34, 99)
--AddBirthPoint("Снежная война", "07xmas2",  144, 136)
--AddBirthPoint("Снежная война", "07xmas2",  144, 243)
--AddBirthPoint("Снежная война", "07xmas2",  251, 40)
--AddBirthPoint("Снежная война", "07xmas2",  266, 88)
--AddBirthPoint("Снежная война", "07xmas2",  27, 55)
--AddBirthPoint("Снежная война", "07xmas2",  200, 50)
--AddBirthPoint("Снежная война", "07xmas2",  220, 220)
--AddBirthPoint("Снежная война", "07xmas2",  165, 253)
--AddBirthPoint("Снежная война", "07xmas2",  33, 220)
--AddBirthPoint("Снежная война", "07xmas2",  66, 201)
--AddBirthPoint("Снежная война", "07xmas2",  34, 99)


--Тюрьма
AddBirthPoint("\210\254\240\252\236\224", "prisonisland", 267,211)
--AddBirthPoint("Тюрьма", "prisonisland", 267,211)


--Острова Зимы
AddBirthPoint("\206\241\242\240\238\226\224 \199\232\236\251", "winterland", 249,868)
--AddBirthPoint("Острова Зимы", "winterland", 249,868)


--Остров Боссов (новогодняя арена)
AddBirthPoint("\206\241\242\240\238\226 \193\238\241\241\238\226", "sdBoss", 530,397)
--AddBirthPoint("Остров Боссов", "sdBoss", 530,397)


--Большая арена
AddBirthPoint("\193\238\235\252\248\224\255 \224\240\229\237\224", "PKmap", 30,34)
AddBirthPoint("\193\238\235\252\248\224\255 \224\240\229\237\224", "PKmap", 101,28)
AddBirthPoint("\193\238\235\252\248\224\255 \224\240\229\237\224", "PKmap", 93,85)
AddBirthPoint("\193\238\235\252\248\224\255 \224\240\229\237\224", "PKmap", 26,85)
--AddBirthPoint("Большая арена", "PKmap", 30,34)
--AddBirthPoint("Большая арена", "PKmap", 101,28)
--AddBirthPoint("Большая арена", "PKmap", 93,85)
--AddBirthPoint("Большая арена", "PKmap", 26,85)


--Комната удачи
AddBirthPoint("\202\238\236\237\224\242\224 \243\228\224\247\232", "mingyun", 249,868)
--AddBirthPoint("Комната удачи", "mingyun", 249,868)


--Аврора
AddBirthPoint("\192\226\240\238\240\2241", "mjing1", 366,395)
AddBirthPoint("\192\226\240\238\240\2242", "mjing2", 350,180)
--AddBirthPoint("Аврора1", "mjing1", 366,395)
--AddBirthPoint("Аврора2", "mjing2", 350,180)



--Тьма
AddBirthPoint("\210\252\236\2243", "mjing3", 351,120)
AddBirthPoint("\210\252\236\2244", "mjing4", 356,116)
--AddBirthPoint("Тьма3", "mjing3", 351,120)
--AddBirthPoint("Тьма4", "mjing4", 356,116)


--Баунти
AddBirthPoint("\193\224\243\237\242\232", "bountypk",  462, 3411)
AddBirthPoint("\193\224\243\237\242\232", "bountypk",  418, 3411)
AddBirthPoint("\193\224\243\237\242\232", "bountypk",  415, 3461)
AddBirthPoint("\193\224\243\237\242\232", "bountypk",  443, 3459)
AddBirthPoint("\193\224\243\237\242\232", "bountypk",  442, 3439)
--AddBirthPoint("Баунти", "bountypk",  462, 3411)
--AddBirthPoint("Баунти", "bountypk",  418, 3411)
--AddBirthPoint("Баунти", "bountypk",  415, 3461)
--AddBirthPoint("Баунти", "bountypk",  443, 3459)
--AddBirthPoint("Баунти", "bountypk",  442, 3439)


--Точки возрождения возле подземелий
AddBirthPoint("\207\238\228\231\229\236\229\235\252\229 \193\224\243\237\242\232", "darkblue",  1340, 579)
AddBirthPoint("\207\238\228\231\229\236\229\235\252\229 \204\232\240 \196\229\236\238\237\238\226", "garner",  915, 1069)
AddBirthPoint("\216\224\233\242\224\237", "magicsea",  814, 3643)
AddBirthPoint("\207\238\228\231\229\236\229\235\252\229 \213\224\238\241\224", "darkblue",  1370, 532)
--AddBirthPoint("Подземелье Баунти", "darkblue",  1340, 579)
--AddBirthPoint("Подземелье Мир Демонов", "garner",  915, 1069)
--AddBirthPoint("Подземелье Затерянного Города", "magicsea",  814, 3643)
--AddBirthPoint("Подземелье Хаоса", "darkblue",  1370, 532)


--PvP зона на новой Арене
AddBirthPoint("\199\238\237\224 PvP", "starena13", 63,36)
--AddBirthPoint("Зона PvP", "starena13", 63,36)

-----------------------Хаос Ледыни
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 154,85)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 67178,164)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 215,235)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 120,140)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 98,110)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 66,66)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 68,233)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 124,180)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 172,133)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 136,145)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 131,102)
AddBirthPoint("\213\224\238\241 \203\229\228\251\237\232", "darkblue2", 67,71)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 154,85)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 67178,164)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 215,235)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 120,140)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 98,110)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 66,66)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 68,233)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 124,180)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 172,133)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 136,145)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 131,102)
--AddBirthPoint("Хаос Ледыни", "darkblue2", 67,71)

--Искупление Демона
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 57,84)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 26,69)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 55,35)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 85,60)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 58,57)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 40,54)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 70,49)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 70,66)
AddBirthPoint("\200\241\234\243\239\235\229\237\232\229 \196\229\236\238\237\224", "greh", 43,75)
--AddBirthPoint("Искупление Демона", "greh", 57,84)
--AddBirthPoint("Искупление Демона", "greh", 26,69)
--AddBirthPoint("Искупление Демона", "greh", 55,35)
--AddBirthPoint("Искупление Демона", "greh", 85,60)
--AddBirthPoint("Искупление Демона", "greh", 58,57)
--AddBirthPoint("Искупление Демона", "greh", 40,54)
--AddBirthPoint("Искупление Демона", "greh", 70,49)
--AddBirthPoint("Искупление Демона", "greh", 70,66)
--AddBirthPoint("Искупление Демона", "greh", 43,75)

--Утопь Демона
AddBirthPoint("\211\242\238\239\252 \196\229\236\238\237\224", "greh1", 33,33)
AddBirthPoint("\211\242\238\239\252 \196\229\236\238\237\224 1", "greh1", 85,33)
AddBirthPoint("\211\242\238\239\252 \196\229\236\238\237\224 2", "greh1", 139,33)
AddBirthPoint("\211\242\238\239\252 \196\229\236\238\237\224 3", "greh1", 33,180)
AddBirthPoint("\211\242\238\239\252 \196\229\236\238\237\224 4", "greh1", 85,180)
AddBirthPoint("\211\242\238\239\252 \196\229\236\238\237\224 5", "greh1", 139,180)
--AddBirthPoint("Утопь Демона", "greh1", 33,33)
--AddBirthPoint("Утопь Демона", "greh1", 85,33)
--AddBirthPoint("Утопь Демона", "greh1", 139,33)
--AddBirthPoint("Утопь Демона", "greh1", 33,180)
--AddBirthPoint("Утопь Демона", "greh1", 85,180)
--AddBirthPoint("Утопь Демона", "greh1", 139,180)


--Захват Флага Барбароссы
AddBirthPoint("Arena 3A", "starena33", 63,47)
AddBirthPoint("Arena 3A", "starena33", 63,80)
AddBirthPoint("Arena 3A", "starena33", 81,63)
AddBirthPoint("Arena 3A", "starena33", 44,63)