-- Имена функций должны заканчиватсья названием карты, такие как after_destroy_entry_abandonedcity
-- Наибольшее число символов в строке составляет 255

function config_entry(entry) 
    SetMapEntryEntiID(entry, 2492,4) 

end 

function after_create_entry(entry) 
    local copy_mgr = GetMapEntryCopyObj(entry, 0) -- Получение информации о точке входа (название карты, координаты, название целевой карты)	

    local EntryName = "Затерянный город "
    SetMapEntryEventName( entry, EntryName )
	
    map_name, posx, posy, tmap_name = GetMapEntryPosInfo(entry) -- Сообщение всем персонажам на сервере
    Notice("\206\225\250\255\226\235\229\237\232\229: \194 \204\224\227\232\247\229\241\234\238\236 \206\234\229\224\237\229 ["..posx..","..posy.."] \238\225\240\224\231\238\226\224\235\224\241\252 \227\232\227\224\237\241\242\234\224\255 \226\238\240\238\237\234\224, \226\241\234\238\240\229 \238\234\224\231\224\235\238\241\252, \247\242\238 \253\242\238 [\199\224\242\229\240\255\237\237\251\233 \195\238\240\238\228].")
	--Notice("Объявление: В Магическом Океане ["..posx..","..posy.."] образовалась гигансткая воронка, вскоре оказалось, что это [Затерянный Город].")

end

function after_destroy_entry_abandonedcity(entry)

    map_name, posx, posy, tmap_name = GetMapEntryPosInfo(entry) 
	Notice("\206\225\250\255\226\235\229\237\232\229: \210\238\235\252\234\238 \247\242\238 \226 \204\224\227\232\247\229\241\234\238\236 \206\234\229\224\237\229 ["..posx..","..posy.."] \231\224\234\240\251\235\241\255 \239\238\240\242\224\235 \226 [\199\224\242\229\240\255\237\237\251\233 \195\238\240\238\228]!") 
    --Notice("Объявление: Только что в Магическом Океане ["..posx..","..posy.."] закрылся портал в [Затерянный Город]!") 

end

function after_player_login_abandonedcity(entry, player_name)
    map_name, posx, posy, tmap_name = GetMapEntryPosInfo(entry) -- Получение информации о точке входа (название карты, координаты, название целевой карты)
    ChaNotice(player_name, "\206\225\250\255\226\235\229\237\232\229: \194 \204\224\227\232\247\229\241\234\238\236 \206\234\229\224\237\229 ["..posx..","..posy.."] \238\225\240\224\231\238\226\224\235\224\241\252 \227\232\227\224\237\241\242\234\224\255 \226\238\240\238\237\234\224, \226\241\234\238\240\229 \238\234\224\231\224\235\238\241\252, \247\242\238 \253\242\238 [\199\224\242\229\240\255\237\237\251\233 \195\238\240\238\228].")
	--ChaNotice(player_name, "Объявление: В Магическом Океане ["..posx..","..posy.."] образовалась гигансткая воронка, вскоре оказалось, что это [Затерянный Город].")

end


function check_can_enter_abandonedcity(role, copy_mgr)

	local Cha = TurnToCha(role)
  
	if Lv(Cha) >=30 and Lv(Cha) <=45 then
	
		local Num
		Num = CheckBagItem(Cha, 1812)
        	
		if Num >= 1 then
			return 1
	
		else
			SystemNotice(role, "\210\251 \237\229 \232\236\229\229\248\252 \239\240\232 \241\229\225\229 \195\229\237\229\240\224\242\238\240\224 \196\240\229\226\237\232\245, \239\238\253\242\238\236\243 \237\229 \236\238\230\229\248\252 \231\224\233\242\232 \226 \199\224\242\229\240\255\237\237\251\233 \195\238\240\238\228 ")
			--SystemNotice(role, "Ты не имеешь при себе Генератора Древних, поэтому не можешь зайти в Затерянный Город ")
			return 0
		end
		
	else
		SystemNotice(role, "\194 \199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 \236\238\227\243\242 \226\245\238\228\232\242\252 \242\238\235\252\234\238 \239\229\240\241\238\237\224\230\232 \241 30 \239\238 45 \243\240\238\226\229\237\252 ")
		--SystemNotice(role, "В Затерянный город могут входить только персонажи с 30 по 45 уровень ")
		return 0    
	end
end



function begin_enter_abandonedcity(role, copy_mgr) 

	local Cha = TurnToCha(role)	
	local Dbag = 0
	Dbag = DelBagItem(Cha, 1812, 1)

	if Dbag == 1 then
		SystemNotice(role,"\194\245\238\228 \226 [\199\224\242\229\240\255\237\237\251\233 \195\238\240\238\228]") 
		--SystemNotice(role,"Вход в [Затерянный Город]") 
		MoveCity(role, "\199\224\242\229\240\255\237\237\251\233 \227\238\240\238\228 1")

	else
	
		SystemNotice(role, "\210\251 \237\229 \236\238\230\229\248\252 \231\224\233\242\232 \226 \199\224\242\229\240\255\237\237\251\233 \195\238\240\238\228 ")
		--SystemNotice(role, "Ты не можешь зайти в Затерянный Город ")
	end


end